kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*
 * 说明：主要包含C8051FUSB相关的操作函数，及上下文机通信的函数，通信协议解析等
 *		 协议解析请参考《HS6200Test 主机与设备之间的应用协议.one》文件。
 *
 * Yao	  20/04/2013
 * HunterSun Electronics Co., Ltd.
 */

#include "HS6200_types.h"
#include "HS6200Test_Application_Protocol.h"
#include "nRF24L01_X.h"
#include "HS6200_test_sys.h"
#include "HS6200_test.h"
#include "USB_API.h" 
#include "stdlib.h"
#include "C8051F_USB.h"
#include "HS6200_Analog_Test.h"
#include "HS6200_Debug.h"
#include "HS6200_Reg.h"
#include "usbsubdev_hs6200.h"


U8 Tx_By_CE_High=0x00;
U8 USB_Discard_Dev_Num=0x00;    //记录需要扔掉的DEV_NUM号
U8 Nop_After_W_Tx_Payload=0x00;

U8 USB_Host_Out_Flag=USB_HOST_OUT_FLAG_C8051F_USED;  //usb host out data to C8051F 
U8 USB_Host_In_Flag=USB_HOST_IN_FLAG_COMPLETED;     //to usb host data   

U8 USB_Host_Out_Packet_Length;
U16 USB_Host_In_Packet_Length;

U8 USB_Host_Out_Packet[MAX_OUT_PACKET_LENGTH];     // packet received from host
U8 USB_Host_In_Packet[MAX_IN_PACKET_LENGTH];       // packet to sent to host

U8 Address_Pipe0[5];    //用于存储pipe0的地址
U8 Ack_Pipe_Num=0x00;    //用于TX 接收到ACK Payload 后，在给上位机回复Payload时，连着应答的通道一起返回。

/*---------------------------------------------------------MCU to USB Host acknowledge------------------------------------------------------------*/ 
//ACK packet
/*
 * USB_Host_In_Packet[0]   USB_Host_In_Packet[1]     USB_Host_In_Packet[2]   USB_Host_In_Packet[3...n]  
 *   PID_ACK                     DevNum                USB_ACK_Buf length		  ACK_Buf
 *	  1Byte	                     1Byte                       1Byte				  0-nByte
 */

void USB_ACK_2_Host(U8 DevNum, U8 ACK_Type, U8 *ACK_Buf, U8 ACK_Buf_Length )
{
	U8 i;
// 	if( (USB_Host_In_Flag==USB_HOST_IN_FLAG_COMPLETED))  //USB Host Has read USB_Host_In_Packet Buffer
// 	{
		USB_Host_In_Packet[0]=PID_ACK;   //PID
		USB_Host_In_Packet[1]=DevNum;    //DEV
		if(ACK_Buf_Length==0x00)
		{
			USB_Host_In_Packet[2]=0;         //packet context length
			Block_Write(USB_Host_In_Packet,3);
		}
	    else 
		{
		        USB_Host_In_Packet[2]=ACK_Buf_Length+0x01;
				USB_Host_In_Packet[3]=ACK_Type;
				for(i=0x00;i<ACK_Buf_Length;i++)
				USB_Host_In_Packet[4+i]=ACK_Buf[i];	
				Block_Write(USB_Host_In_Packet,4+ACK_Buf_Length);
		}
		USB_Host_In_Flag=USB_HOST_IN_FLAG_NOT_COMPLETED;  
// 	}
}
/*
 *    P[0]       P[1]      P[2]     P[3]        P[4..35]  
 *  PID_DATA	devnum	 length	  pipe_num	  ACK payload
 *   0x05	  0x00/0x01	   xx	 PIPE0-PIPE5      xx
 *  1Byte	    1Byte    1Byte 	   1Byte	   1-32Bytes
 *
 */

void USB_DATA_2_Host(U8 DevNum,U8 PipeNum, U8 *Data_Buf,U8 Data_Buf_Length )
{
	U8 i;
	if( (USB_Host_In_Flag==USB_HOST_IN_FLAG_COMPLETED))  //USB Host Has read USB_Host_In_Packet Buffer
	{
		USB_Host_In_Packet[0]=PID_DATA;   //PID
		USB_Host_In_Packet[1]=DevNum;     //DEV
		if(PipeNum<=0x05)
			USB_Host_In_Packet[2]=Data_Buf_Length+1;   //length+pipe=length+1		
		else
			USB_Host_In_Packet[2]=Data_Buf_Length;
		if(Data_Buf_Length==0x00)
		{	
			Block_Write(USB_Host_In_Packet,3);
		}
	    else 
		{
		    if(PipeNum<=0x05)
			{
				USB_Host_In_Packet[3]=PipeNum; 			    //pipe num
				for(i=0x00;i<Data_Buf_Length;i++)USB_Host_In_Packet[4+i]=Data_Buf[i];	
				Block_Write(USB_Host_In_Packet,4+Data_Buf_Length); //PID+DEV+length+pipe num=4Bytes
			}
			else
			{
				for(i=0x00;i<Data_Buf_Length;i++)USB_Host_In_Packet[3+i]=Data_Buf[i];	
				Block_Write(USB_Host_In_Packet,3+Data_Buf_Length); //PID+DEV+length=4Bytes
			}	
		}
		USB_Host_In_Flag=USB_HOST_IN_FLAG_NOT_COMPLETED;  
	}
}

//busy, device is busy.
void USB_NAK_2_Host(U8 DevNum)
{
	if(USB_Host_In_Flag==USB_HOST_IN_FLAG_COMPLETED)  //USB Host Has read USB_Host_In_Packet Buffer
	{
		USB_Host_In_Packet[0]=PID_NAK;   //PID
		USB_Host_In_Packet[1]=DevNum;      //DEV 
		USB_Host_In_Packet[2]=0x00;         //packet context length
		Block_Write(USB_Host_In_Packet,3);
		USB_Host_In_Flag=USB_HOST_IN_FLAG_NOT_COMPLETED;  
	}
}

/*----------------------------------------------------------1.Communication Test------------------------------------------------------------*/
//make resolution protocol between PC and MCU(CPU) communication 
/*
 * Communication 
 *  Packet[0]     Packet[1]            Packet[2]            Packet[3]       Packet[4..n] 
 *    PID            Dev                  Bytes               pipe        payload/ACK payload
 *  PID_COMM      Dev_0/Dev_1      packet context length    pipe index        
 *   1Byte           1Byte               1+1——1+32Bytes       1Byte           32Bytes   
 *   0x01			                                                                               
 */

void Comn_Mode(U8 DevNum,U8* Cmd_Argument, U8 Cmd_Argument_Length)
{	
	U8 Addr_Temp[5];
	U8 i; 
	U8 Addr_Width;
	 
	switch(Cmd_Argument[0])
	{
		/*
		 * Cmd_Argument[0]        Cmd_Argument[1]            Cmd_Argument[2..6]	     Cmd_Argument[n]
		 *	  TXPL			  Pipe Num width/Addr width		Pipe Num/Addr Width			 Payload
		 *    0x00				0x01/0x03/0x04/0x05 		       xx 					   xx
		 *    1Byte     	           1Byte				    1-5Bytes				1-32Bytes
		 *
		 */

		case TXPL:
		    /*  Cmd_Argument[0]	 Cmd_Argument[1]    Cmd_Argument[2]	   Cmd_Argument[3..34]
			 *	   TXPL			 Pipe Num width		    Pipe Num			 payload
			 *	   0x00			     0x01		 	  PIPE0-PIPE5			    xx
			 *	  1Byte			    1Byte			      1Byte				 1-32Bytes
			 */	
			if(Cmd_Argument[1]==COMM_PIPE)	  //给定通道
			{				
// 				if(DevNum==DEV_0)	  //DEV_0
// 				{
// 					Addr_Width=nRF24L01_X_get_aw(DEV_1);
// 					nRF24L01_X_set_address_width(DEV_0,Addr_Width);	   //设置address width

// 					if(Dev_Flag[DEV_1]==nRF24L01_DEV)  //nRF24L01 dev
// 					{
// 						if(Cmd_Argument[2]>PIPE1)  //PIPE2 PIPE3 PIPE4 PIPE5
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P1,Addr_Temp,Addr_Width);  //读地址
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址	
// 						} 
// 						else 	//PIPE0 PIPE1
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
// 						nRF24L01_X_write_pipe_addr(DEV_0, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);   //写地址
// 						if( nRF24L01_X_is_auto_ack_px(DEV_0,0) )
// 							nRF24L01_X_write_pipe_addr(DEV_0, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);   //写地址
// 					}
// 					else if(Dev_Flag[DEV_0]==HS6200_DEV)	 //HS6200 dev
// 					{
// 						if(Cmd_Argument[2]>PIPE0) //PIPE1 PIPE2 PIPE3 PIPE4 PIPE5 
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //读地址
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址								
// 						}
// 						else	//PIPE0
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_1,HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //读地址
// 						}
// 						nRF24L01_X_write_pipe_addr(DEV_0, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);   //写地址
// 						if( nRF24L01_X_is_auto_ack_px(DEV_0,0) ) 
// 							nRF24L01_X_write_pipe_addr(DEV_0, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);   //写地址
// 					}					
// 				}
// 				else if(DevNum==DEV_1) 		//DEV_1
// 				{
// 					Addr_Width=nRF24L01_X_get_aw(DEV_0);
// 					nRF24L01_X_set_address_width(DEV_1,Addr_Width);
// 					if(Dev_Flag[DEV_0]==nRF24L01_DEV)  //nRF24L01 dev
// 					{
// 						if(Cmd_Argument[2]>PIPE1)  //PIPE2 PIPE3 PIPE4 PIPE5
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P1,Addr_Temp,Addr_Width);  //读地址
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址	
// 						} 
// 						else 	//PIPE0 PIPE1
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
// 						nRF24L01_X_write_pipe_addr(DEV_1, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);   //写地址
// 						if( nRF24L01_X_is_auto_ack_px(DEV_1,0) ) 
// 							nRF24L01_X_write_pipe_addr(DEV_1, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);   //写地址
// 					}
// 					else if(Dev_Flag[DEV_0]==HS6200_DEV)	 //HS6200 dev
// 					{
// 						if(Cmd_Argument[2]>PIPE0) //PIPE1 PIPE2 PIPE3 PIPE4 PIPE5 
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //读地址
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址								
// 						}
// 						else	//PIPE0
// 						{
// 							nRF24L01_X_read_pipe_addr(DEV_0,HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //读地址
// 						}
// 						nRF24L01_X_write_pipe_addr(DEV_1, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);   //写地址
// 						if( nRF24L01_X_is_auto_ack_px(DEV_1,0) ) 
// 							nRF24L01_X_write_pipe_addr(DEV_1, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);   //写地址
// 					}					
// 				}

