kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
				if(Dev_Flag[DevNum]!=DEV_NONE)   //DEV_NONE
				{
					Addr_Width=nRF24L01_X_get_aw(DevNum);
					if(Dev_Flag[DevNum]==HS6200_DEV)
					{						
						//nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //读地址
                       			 for(i=0x00;i<Addr_Width;i++)Addr_Temp[i]=Address_Pipe0[i];
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分	
                        if(Cmd_Argument[2]==PIPE0)
                        {
                             for(i=0;i<Addr_Width;i++)Addr_Temp[i]=Address_Pipe0[i];
                        }
                        else
                            nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分	                             
					}
					else if(Dev_Flag[DevNum]==nRF24L01_DEV)
					{
						if( Cmd_Argument[2]==PIPE0 )        //PIPE0 
						{
							//nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
                            for(i=0;i<Addr_Width;i++)Addr_Temp[i]=Address_Pipe0[i];
						}
                        else if (Cmd_Argument[2]==PIPE1)	// PIPE1			
                        {
                            nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
                        }
                        else if (Cmd_Argument[2]>PIPE1)     //PIPEx 
						{
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Addr_Temp,Addr_Width);  //读地址
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分	
						}
					}
	//				nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);      //写发送地址   
    //              nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);   //写PIPE0地址                  
				 }			
//				 if ( (!nRF24L01_X_Busy[DevNum])  )		 //not busy began to tx
				 {
				 	 nRF24L01_X_Busy[DevNum] = 1;
					 if(nRF24L01_X_is_tx_fifo_full(DevNum))   //Tx fifo Full
					 {
						 	
					 }
					 nRF24L01_X_write_tx_payload(DevNum,&Cmd_Argument[3],Cmd_Argument_Length-0x03);					
//					 if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
//					 if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
//					 else nRF24L01_X_ce_high_pulse(DevNum); 
					 
					 Ack_Pipe_Num=Cmd_Argument[2];  //应答通道号,发送了才记住通道号  
				 }
//                  else 
//                  {
//                      if(  ( (DevNum==DEV_0) && (nRF24L01_0_EI==0) && (Dev_Flag[DEV_0]!=DEV_NONE)) ||  ( (DevNum==DEV_1) && (nRF24L01_1_EI==0) && (Dev_Flag[DEV_1]!=DEV_NONE) )  )
//                      {
//                         nRF24L01_X_write_tx_payload(DevNum,&Cmd_Argument[3],Cmd_Argument_Length-0x03);					
//                         if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
//                         if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
//                         else nRF24L01_X_ce_high_pulse(DevNum); 
//                      }
//                  }
                     
			}
			/* 
			 * Cmd_Argument[0]	   Cmd_Argument[1]   Cmd_Argument[2..6]         Cmd_Argument[5/7]  
			 *	  TXPL				 Addr width			  address		  packet context(32Bytes Max)
			 *	  1Byte				   1Byte	          3-5Bytes 				   1-32Bytes
			 * 
			 */
			else if( (Cmd_Argument[1]==COMM_ADDR_WIDTH3) || (Cmd_Argument[1]==COMM_ADDR_WIDTH4) || (Cmd_Argument[1]==COMM_ADDR_WIDTH5) )	 //给定地址
			{
				Addr_Width=Cmd_Argument[1];  //addr width
				nRF24L01_X_set_address_width(DevNum,Addr_Width);  //set Tx address width
				for(i=0x00;i<Addr_Width;i++)Addr_Temp[i]=Cmd_Argument[Addr_Width+0x01-i];   //0x02+Cmd_Arguemnt[1]-0x01-i
				nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);  //set Tx address
				if( nRF24L01_X_is_auto_ack_px(DevNum, 0) ) 	    //auto ACK
				{
                    nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width); 		
                    for(i=0x00;i<Addr_Width;i++)Address_Pipe0[i]=Addr_Temp[i];                            //存储Pipe0的地址
                }
			
//				if (!nRF24L01_X_Busy[DevNum])
			    {
			        nRF24L01_X_Busy[DevNum] = 1;  			
					if(nRF24L01_X_is_tx_fifo_full(DevNum))   //Tx fifo Full
					{
						
					}					
					nRF24L01_X_write_tx_payload(DevNum,&Cmd_Argument[2+Cmd_Argument[1]],Cmd_Argument_Length-0x02-Cmd_Argument[1]);
					if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);  //此处必须有SPI操作，否则 HS6200内部的FIFO写指针不会移动，就会造成发空包的问题
			        if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); //CE 为高时发送， 因为ce为低时内部PLL无时钟
					else nRF24L01_X_ce_high_pulse(DevNum);       //pulse 发送
			    }
//                 else 
//                 {
//                      if(  ( (DevNum==DEV_0) && (nRF24L01_0_EI==0) && (Dev_Flag[DEV_0]!=DEV_NONE)) ||  ( (DevNum==DEV_1) && (nRF24L01_1_EI==0) && (Dev_Flag[DEV_1]!=DEV_NONE) )  )
//                      {
//                         nRF24L01_X_write_tx_payload(DevNum,&Cmd_Argument[2+Cmd_Argument[1]],Cmd_Argument_Length-0x02-Cmd_Argument[1]);				
//                         if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
//                         if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
//                         else nRF24L01_X_ce_high_pulse(DevNum); 
//                      }
//                 }
			}
			else			  //data err
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_COMM_DATA);
					#else
				    	USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_DATA);	
					#endif
				#endif  /*HS6200_DEBUG*/
			}		
		break;
		case TXPLNAK:
			if(Cmd_Argument[1]==COMM_PIPE)	  //给定通道
			{				
				if(Dev_Flag[DevNum]!=DEV_NONE)   //DEV_NONE
				{
					Addr_Width=nRF24L01_X_get_aw(DevNum);
					if(Dev_Flag[DevNum]==HS6200_DEV)
					{								
                        if(Cmd_Argument[2]==PIPE0)
                        {
                             for(i=0;i<Addr_Width;i++)Addr_Temp[i]=Address_Pipe0[i];
                        }
                        else
                            nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分	          
					}
					else if(Dev_Flag[DevNum]==nRF24L01_DEV)
					{
                        if( Cmd_Argument[2]==PIPE0 )        //PIPE0 
						{
							//nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
                            for(i=0;i<Addr_Width;i++)Addr_Temp[i]=Address_Pipe0[i];
						}
                        else if (Cmd_Argument[2]==PIPE1)	// PIPE1			
                        {
                            nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
                        }
                        else if (Cmd_Argument[2]>PIPE1)     //PIPEx 
						{
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Addr_Temp,Addr_Width);  //读地址
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分	
						}
// 						if(Cmd_Argument[2]>PIPE1)
// 						{
// 							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Addr_Temp,Addr_Width);  //读地址
// 							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,1);  //读地址--覆盖地址的低字节部分
// 						}
// 						else if( ((Cmd_Argument[2]==PIPE0) || (Cmd_Argument[2]==PIPE1)) )
// 						{
// 							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0+Cmd_Argument[2],Addr_Temp,Addr_Width);  //读地址
// 						}
					}
					nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);   //写地址
				 }
//				if(!nRF24L01_X_Busy[DevNum])
				{
					if(nRF24L01_X_is_tx_fifo_full(DevNum))   //Tx fifo Full
					{
					
