kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
					}
					nRF24L01_X_Busy[DevNum] = 1;  
					nRF24L01_X_write_tx_payload_noack(DevNum,&Cmd_Argument[3],Cmd_Argument_Length-0x03);
					if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
					if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
					else nRF24L01_X_ce_high_pulse(DevNum);
				}
//                else 
//                {
//                     if(  ( (DevNum==DEV_0) && (nRF24L01_0_EI==0) && (Dev_Flag[DEV_0]!=DEV_NONE)) ||  ( (DevNum==DEV_1) && (nRF24L01_1_EI==0) && (Dev_Flag[DEV_1]!=DEV_NONE) )  )
//                    {
//                        nRF24L01_X_write_tx_payload_noack(DevNum,&Cmd_Argument[3],Cmd_Argument_Length-0x03);					
//                        if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
//                        if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
//                        else nRF24L01_X_ce_high_pulse(DevNum); 
//                     }
//                 }				
			}
			/*
			 * Cmd_Argument[0]   Cmd_Argument[1]   Cmd_Argument[2..6]   Cmd_Argument[5/7..36/38]
			 *    TXPLNAK		   Addr Width		      addr	                context
			 *     1Byte		     1Byte				3/5Bytes			   1-32Bytes
			 *
			 */
			else if( (Cmd_Argument[1]==COMM_ADDR_WIDTH3) || (Cmd_Argument[1]==COMM_ADDR_WIDTH4) || (Cmd_Argument[1]==COMM_ADDR_WIDTH5) )	 //给定地址
			{
				Addr_Width=Cmd_Argument[1];
				nRF24L01_X_set_address_width(DevNum,Addr_Width);  //set Tx address width
				for(i=0x00;i<Addr_Width;i++)Addr_Temp[i]=Cmd_Argument[Addr_Width+0x01-i];   //0x02+Addr_Width-0x01-i
				nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_TX_ADDR,Addr_Temp,Addr_Width);  //set Tx address
				if( (nRF24L01_X_read_reg(DevNum, nRF24L01_EN_AA) & nRF24L01_EN_AA_P0) ) // 自动应答条件下
						nRF24L01_X_write_pipe_addr(DevNum, HS6200_BANK0_RX_ADDR_P0,Addr_Temp,Addr_Width);  //set Rx Pipe0 address
				
				if(!nRF24L01_X_Busy[DevNum])
				{
					nRF24L01_X_Busy[DevNum] = 1;  
					if(nRF24L01_X_is_tx_fifo_full(DevNum))   //Tx fifo Full
					{
						
					}
					   	
					nRF24L01_X_write_tx_payload_noack(DevNum,&Cmd_Argument[2+Cmd_Argument[1]],Cmd_Argument_Length-0x02-Cmd_Argument[1]);  //Payload length=Cmd_Arguemnt_Length-TXPL cmd(1Byte)-addr width arguemnt(1Byte)-Addr width  
					if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
					if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
					else nRF24L01_X_ce_high_pulse(DevNum);
				}
                else
                {
 //                    if(  ( (DevNum==DEV_0) && (nRF24L01_0_EI==0) && (Dev_Flag[DEV_0]!=DEV_NONE)) ||  ( (DevNum==DEV_1) && (nRF24L01_1_EI==0) && (Dev_Flag[DEV_1]!=DEV_NONE) )  )
                     {
                       nRF24L01_X_write_tx_payload_noack(DevNum,&Cmd_Argument[2+Cmd_Argument[1]],Cmd_Argument_Length-0x02-Cmd_Argument[1]);				
                        if(Nop_After_W_Tx_Payload)nRF24L01_X_nop(DevNum);
                        if(Tx_By_CE_High) nRF24L01_X_ce_high(DevNum); 
                        else nRF24L01_X_ce_high_pulse(DevNum); 
                     }
                }
			}
			else
			{
				 #ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_COMM_DATA);
					#else
				    	USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_DATA);	
					#endif
				#endif  /*HS6200_DEBUG*/
			}
		break;

		/*
		 * Cmd_Argument[0]	 Cmd_Argument[1] Cmd_Argument[2]  Cmd_Argument[3..34]
		 *	  ACKPL			   Pipe width       Pipe Idx	   ACK Payload
		 *	  0x02			     0x01          Pipe0-Pipe5   	1-32Bytes
		 *    1Byte			    1Byte            1Byte			   xx
		 *
		 */
		case ACKPL:	         //ACK包只支持给定通道的应答
			if(Cmd_Argument[1]==COMM_PIPE)	  //给定通道
			{
				if(Cmd_Argument[2]<=PIPE5)	     //pipe right
				{
					nRF24L01_X_write_ack_payload(DevNum,Cmd_Argument[2],&Cmd_Argument[3],Cmd_Argument_Length-0x03);  //write ACK payload 
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else			  //pipe err
				{
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_COMM_PIPE);
						#else
		    				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_PIPE);	
						#endif
					#endif  /*HS6200_DEBUG*/	
				} 				
			}
			else  //data err
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_COMM_DATA);
					#else
				    	USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_DATA);	
					#endif
				#endif  /*HS6200_DEBUG*/
			}
		break;
		case COMM_INIT:
			nRF24L01_X_ptx_init(DEV_0);  //PTX init
    		nRF24L01_X_prx_init(DEV_1);  //PRX init
			USB_ACK_2_Host(DEV_0,0,NULL,0);
		break;
		default:
		break;
	}
}
void Comm_Protocol_Resolut(void) 
{
	U8 i;	
	U8 DevNum;
	U8 Cmd_Argument[39];  	// Cmd(1Byte)+ Address_Length(1Byte)+Address(Max 5Bytes)+Payload(32Bytes)=39Bytes (Max length)	
	U8 Cmd_Argument_Length=0x00;

	HS6200_Bank0_Activate(DEV_0);  //Bank0 status
	HS6200_Bank0_Activate(DEV_1);  //Bank0 status
	
	DevNum=USB_Host_Out_Packet[1];
	Cmd_Argument_Length=USB_Host_Out_Packet[2];										   
	if( (Cmd_Argument_Length<=39) || (Cmd_Argument_Length>=0x04))  // Cmd(1Byte)+ Address_Length(1Byte)+Address(Max 5Bytes)+Payload(Max 32Bytes)=39Bytes  
	{															   // Cmd(1Byte)+ pipe_cmd(1Byte) + pipe num(1Byte)+Payload(Min 1Byte)=4Bytes
		for(i=0x00;i<Cmd_Argument_Length;i++) Cmd_Argument[i]=USB_Host_Out_Packet[3+i];	
		
		if(DevNum==RF_DEV_0)Comn_Mode(DEV_0,Cmd_Argument,Cmd_Argument_Length); 
		else if(DevNum==RF_DEV_1)Comn_Mode(DEV_1,Cmd_Argument,Cmd_Argument_Length); 
		else  //dev err
	    {
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_COMM_RF_DEV);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_RF_DEV);
				#endif
			#endif	
		}					
	}
	else   //length err
	{
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_COMM_LENGTH);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_COMM_LENGTH);
			#endif
		#endif	
	}
}

