kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*--------------------------------------------------------Setup Test-------------------------------------------------------------*/
/*
 * 
 *
 */
void SetupMode(U8 DevNum,U8* Cmd_Argument,U8 Cmd_Argument_Length)
{
	U8 Temp[5];  //用于更改地址
	U8 i=0x00;

	switch(Cmd_Argument[0])
	{
		
		case SET_POWER_UP:
			nRF24L01_X_set_powerup(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PWOER_DOWN:
			nRF24L01_X_set_powerdown(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0); 
		break;
	    case SET_CRC:
			if( Cmd_Argument_Length==0x02 ) 
			{
				if( (Cmd_Argument[1]==CRC_0) || (Cmd_Argument[1]==CRC_1) || (Cmd_Argument[1]==CRC_2))
				{
					nRF24L01_X_set_crc(DevNum,Cmd_Argument[1]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else
				{
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
				    #endif
				}
			}
			else 
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif
				#endif
			}
		break;
	    /*
		 * Argument=0x00   250us
		 * Argument=0x01   500us
		 * Argument=0x02   750us
		 * ...
		 * Argument=0x0F   4000us
		 *
		 *deylay=(Argument+0x01)*250us
		 *
		 */
		case SET_ARD:        /*set auto retransmit delay*/
			if(Cmd_Argument_Length==0x02)
			{
				if(Cmd_Argument[1]<=0x0F)
				{			
					nRF24L01_X_set_auto_retr_delay(DevNum,Cmd_Argument[1]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else
				{
					 #ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
					#endif
				}
			}
			else
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif
				#endif
			}
		break;

		/*
		 * Argument=0x00   retransmit disable
		 * Argument=0x01   1
		 * Argument=0x02   2
		 * ...
		 * Argument=0x0F   15
 		 */	
 		case SET_ARC:        /*set auto retransmit count*/
			if(Cmd_Argument_Length==0x02)
			{
				if(Cmd_Argument[1]<=0x0F)
				{
					nRF24L01_X_set_auto_retr_count(DevNum,Cmd_Argument[1]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else
				{
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
					#endif
				}
			}
			else
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif
				#endif
			}
		break;
		case SET_RF_CH:
			if(Cmd_Argument[1]<=125)		   //channal:0-125
			{
				nRF24L01_X_set_rf_ch(DevNum,Cmd_Argument[1]);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
			else
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
					#endif
				#endif	
			}
		break;
		case SET_RF_AIR_DATARATE:  
			if(Dev_Flag[DevNum]==HS6200_DEV)   //HS6200
			{
				HS6200_Data_Rate(DevNum,Cmd_Argument[1]);
			}
			else							  //nRF24L01
				nRF24L01_X_set_rf_datarate(DevNum,Cmd_Argument[1]);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_RF_OUTPUT_POWER:
			if(Dev_Flag[DevNum]==HS6200_DEV)	//HS6200 dev
			{
				if(Cmd_Argument[1]<=0x04)
				{
					HS6200_PA_power(DevNum,Cmd_Argument[1]);
					USB_ACK_2_Host(DevNum,0,NULL,0);				
				}
				else
				{
					  #ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
					#endif
				}
			}
			else				//nRF24L01 dev
			{
				if(Cmd_Argument[1]<=0x03)
				{
					nRF24L01_X_set_rf_output_power(DevNum,Cmd_Argument[1]);
					USB_ACK_2_Host(DevNum,0,NULL,0);			
				}
				else
				{
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
					#endif
				}
			}
		break;
		case SET_INT_MASK_RX_DR:
			 nRF24L01_X_set_mask_rx_dr(DevNum,Cmd_Argument[1]);
			 USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_INT_MASK_TX_DS:
			 nRF24L01_X_set_mask_tx_ds(DevNum,Cmd_Argument[1]);
			 USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_INT_MASK_MAX_RT:
			 nRF24L01_X_set_mask_max_rt(DevNum,Cmd_Argument[1]);
			 USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_ADDR_WIDTH:
			nRF24L01_X_set_address_width(DevNum,Cmd_Argument[1]);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_TX_ADDR:
			for(i=0x00;i<Cmd_Argument_Length-0x01;i++)Temp[i]=Cmd_Argument[Cmd_Argument_Length-0x01-i];	   //Cmd_Argument_Length-0x01-0x01+i+0x01
			nRF24L01_X_write_pipe_addr(DevNum,nRF24L01_TX_ADDR,Temp,Cmd_Argument_Length-0x01);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_EN: 
			if(Cmd_Argument_Length==0x03)
			{
				if( (Cmd_Argument[2]==0) || (Cmd_Argument[2]==1) )
				{
					nRF24L01_X_set_en_rx_pipe(DevNum,Cmd_Argument[1],Cmd_Argument[2]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else
				{
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_SETUP_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_DATA);
						#endif
					#endif
				}
			}
			else   //length err
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif
				#endif
			}
		break;
		case SET_PIPE_AUTO_ACK:
			nRF24L01_X_set_en_auto_ack_pipe(DevNum,Cmd_Argument[1],Cmd_Argument[2]);	  //DevNum/pipe/en
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_DPL:		//dynamic payload length
			if(Cmd_Argument[2])		  
			{
				nRF24L01_X_set_en_dpl_px(DevNum,Cmd_Argument[1],1);
			}
			else
			{
				nRF24L01_X_set_en_dpl_px(DevNum,Cmd_Argument[1],0);				
			}
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_ADDR:
			for(i=0x00;i<Cmd_Argument_Length-0x02;i++)Temp[i]=Cmd_Argument[Cmd_Argument_Length-i-0x01];	   //Cmd_Argument_Length-0x02-0x01+i+0x02
            if(Cmd_Argument[1]==PIPE0) for(i=0x00;i<Cmd_Argument_Length-0x02;i++)Address_Pipe0[i]= Temp[i];  //存储Pipe0的地址              
            nRF24L01_X_write_pipe_addr(DevNum,nRF24L01_RX_ADDR_P0+Cmd_Argument[1],Temp,Cmd_Argument_Length-0x02);  //minus cmd code(1Byte)			 
            USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_PIPE_STATIC_PLW:
			nRF24L01_X_set_rx_pipe_static_pay_load_width(DevNum,Cmd_Argument[1],Cmd_Argument[2]);	//设置PAYLOAD length
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;		
		case SET_PTX:
			nRF24L01_X_set_ptx(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break; 
		case SET_PRX:
			nRF24L01_X_set_prx(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_SPL:
			nRF24L01_X_set_en_dpl_feature(DevNum,0);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_DPL:
			nRF24L01_X_set_en_dpl_feature(DevNum,1);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_SA:
			nRF24L01_X_sa_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_DA:
			nRF24L01_X_da_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_NAK:
			nRF24L01_X_noack_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_ACK:
			nRF24L01_X_ack_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_AE:    //ACK empty mode
			nRF24L01_X_ack_empty_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_AP:
			nRF24L01_X_ack_pay_mode(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_NAR:		 //no auto retransmit
//			nRF24L01_X_noretr_mode(DevNum); 
//			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_AR:		 //auto retransmits
//			if(Cmd_Argument_Length==0x02)
//			{
//				nRF24L01_X_ar_mode(DevNum,Cmd_Argument[1]);		 //根据参数进行调整
//			}
//			else
//			{
//				 nRF24L01_X_ar_mode(DevNum,10);        //10次重发
//			}
//			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_NMR:
			nRF24L01_X_mr_mode(DevNum,0);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_MR:
			nRF24L01_X_mr_mode(DevNum,1);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_COMMODE:
			if(Cmd_Argument_Length==0x02)
			{
				HS6200_Mode_Config(DevNum,Cmd_Argument[1]);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
			else
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}			
		break;
		case SET_CE_LOW_BEFORE_W_REG:
			if(Cmd_Argument[1]==0x01)
				ce_low_befor_write=1;
			else
				ce_low_befor_write=0; 
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_CAL_AFTER_ACK:
			if(Cmd_Argument[1]==0x01)
				Cal_after_Ack=1;
			else
				Cal_after_Ack=0; 
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SET_MCU_MASK_EX0:
			if(Cmd_Argument_Length==0x02)
			{
//				if(Cmd_Argument[1]==0x01)
//					nRF24L01_0_EI=0;
//				else if(Dev_Flag[DEV_0]==DEV_NONE)	  // 如果是DEV_NONE 则不能打开xx_EI，因为打开后，程序进入中断，就会死在中断里
//					nRF24L01_0_EI=0;
//				else nRF24L01_0_EI=1;
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
			else		//length  err
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}
		break;
		case SET_MCU_MASK_EX1:
			if(Cmd_Argument_Length==0x02)
			{
//				if(Cmd_Argument[1]==0x01)
//					nRF24L01_1_EI=0;
//				else if(Dev_Flag[DEV_1]==DEV_NONE)	  // 如果是DEV_NONE 则不能打开xx_EI，因为打开后，程序进入中断，就会死在中断里
//					 nRF24L01_1_EI=0;
//				else nRF24L01_1_EI=1;	 //有dev的时候，才打开中断
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
			else		  //length err
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}
		break;
		default:     //cmd err
		{
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_SETUP_CMD);
				#else
				    USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_CMD);	
				#endif
			#endif  /*HS6200_DEBUG*/
		}
		break;
	}
}

