kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*
 *	 P[0]      P[1]            P[2]                 P[3]		P[4]
 *	 PID	   dev		 Packet Context Length	  cmd code	  argument
 *	0x02	DEV_0/DEV_1		    xx					xx		    xx
 *	1Byte	  1Byte			  1Byte				   1Byte
 *
 */

//setup protocol resolution
void Setup_Protocol_Resolut(void)  //make resolution protocol of between PC and MCU(CPU) communication 
{ 
	U8 i;
	U8 DevNum;
	U8 Cmd_Argument[10];	
	U8 Cmd_Argument_Length=0x00;
	DevNum=USB_Host_Out_Packet[1];
	Cmd_Argument_Length=USB_Host_Out_Packet[2];		   //cmd argument length
	if(Cmd_Argument_Length<=10)
	{
		for(i=0x00;i<Cmd_Argument_Length;i++)Cmd_Argument[i]=USB_Host_Out_Packet[3+i];	 //P[3..n]-->cmd & argument
		
		if(USB_Host_Out_Packet[1]==RF_DEV_0) 
		{
			HS6200_Bank0_Activate(DEV_0);
			SetupMode(DEV_0,Cmd_Argument,Cmd_Argument_Length);
		}
		else if(USB_Host_Out_Packet[1]==RF_DEV_1)
		{
		    HS6200_Bank0_Activate(DEV_1);
			SetupMode(DEV_1,Cmd_Argument,Cmd_Argument_Length);
		}
		else        //rf dev err
		{
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_SETUP_RF_DEV);
				#else
				    USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_RF_DEV);
				#endif	
			#endif  /*HS6200_DEBUG*/
		}
	}	
	else
	{	
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_SETUP_LENGTH);
			#else
			    USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SETUP_LENGTH);
			#endif	
		#endif  /*HS6200_DEBUG*/		
	}	
}

/*---------------------------------------------SPI Test-------------------------------------------------*/
void SPI_Mode(U8 DevNum,U8 Cmd,U8 *Argument,U8 Argument_Length)
{
	U8 pTemp[33];  //story payload and so on
	U8 i;
	switch(Cmd)        //Cmd: SPI Cmd -->similar to nRF24L01 SPI command 
	{
		case nRF24L01_R_REGISTER:     //read register
		/*
		 *    Argument[0]                 Argument[1]                    
		 *   Register Addr    Bytes(1= read 1Byte ,other= n bytes)  
         *  
         *  Argument_Length=2 	
		 * Register Addr: Bank1 register address's MSBit is 1,while Bank0 is 0.	
		 */
            if(Argument_Length==0x02)
			{	
				pTemp[0]=Argument[0];	     //reg addr
				pTemp[1]=Argument[1];		 //length
				if( (Argument[0]& HS6200_BANK_BIT)==HS6200_BANK1 )	   //read Bank1
				{	
					HS6200_Bank1_Activate(DevNum);
					Argument[0]&=~HS6200_BANK_BIT;
				}
				else HS6200_Bank0_Activate(DevNum);		      //read bank0
			
				/*  reg addr     xx Bytes    reg val
				 *  1Byte         1Byte       1Byte 
				 *
				 */
				if(Argument[1]>0x01) //multibytes  				  
				{
					nRF24L01_X_read_reg_multibytes(DevNum,Argument[0],(pTemp+2),Argument[1]);  //read multibytes
					USB_ACK_2_Host(DevNum,TYPE_REG,pTemp,Argument[1]+2);	
				}
				else 	              //1Byte
				{	
					pTemp[2]=nRF24L01_X_read_reg(DevNum,Argument[0]); //read one byte
					USB_ACK_2_Host(DevNum,TYPE_REG,pTemp,3);
				}
			}
			else		//arguement length err
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/	
			}
		break;
		case nRF24L01_W_REGISTER:
		  /*
		   *  Argument[0]               Argument[1]                      Argument[2...n]
		   *  Register Addr    Bytes(1= write 1Byte ,n=multibytes)       register value 
		   *
		   * Argument_Length=n 
		   */
		    if(Argument_Length>=0x03)
			{
				if( (Argument[0]& HS6200_BANK_BIT)==HS6200_BANK1 )	   //write Bank1
				{	
					HS6200_Bank1_Activate(DevNum);
					Argument[0]&=~HS6200_BANK_BIT;
				}
				else     //bank 0
                {
                    HS6200_Bank0_Activate(DevNum);		   //write bank0
                    if(Argument[0]==nRF24L01_RX_ADDR_P0) for(i=0x00;i<Argument[1];i++)Address_Pipe0[i]=Argument[2+i];   //存储Pipe0的地址
                }
				if(Argument[1]>0x01)nRF24L01_X_write_reg_multibytes(DevNum,Argument[0],&Argument[2],Argument[1]);  //write multibytes
				else nRF24L01_X_write_reg(DevNum,Argument[0],Argument[2]);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
			else 
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/		
			}
		break;
		case nRF24L01_R_RX_PAYLOAD:
		  /*
		   *  Argument[0]
		   *   xxBytes
		   *  read rx payload bytes
		   *  
		   *  Argument_Length=1 
		   */
		    if(Argument_Length==0x01)
			{
				pTemp[0]=0x00;    //这个地方通道号设为0                  
		    	nRF24L01_X_read_rx_payload(DevNum,&pTemp[1],Argument[0]);		  
				USB_ACK_2_Host(DevNum,TYPE_PLD,pTemp,Argument[0]+1);  
			}
			else
			{
				#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_W_TX_PAYLOAD:
		  /*
		   *           Argument[0]                  Argument[1...n]
		   *  xxBytes (write tx payload bytes)          payload
		   *          
		   * Argument_Length=n;
		   */
		   if( (Argument_Length>=0x02) && (Argument_Length<=0x33) )
		   {
				 for(i=0x00;i<(Argument_Length-0x01);i++)pTemp[i]=Argument[1+i];	 //minus Argument[0] (xxBytes)
				 nRF24L01_X_write_tx_payload(DevNum,pTemp,Argument[0]);
			     USB_ACK_2_Host(DevNum,0,NULL,0);
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_FLUSH_TX:
		  /*
		   *    Argument[0]              
		   *      NULL
		   * 
           *  Argument_Length=0		
		   */
		   if(Argument_Length==0x00)
		   {  	
		   		nRF24L01_X_flush_tx(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
		   }
 		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_FLUSH_RX:
			/*
		   *    Argument[0]              
		   *      NULL
		   * 
           *  Argument_Length=0		
		   */
		   if(Argument_Length==0x00)
		   {
				nRF24L01_X_flush_rx(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}		
		break;
		case nRF24L01_REUSE_TX_PL:
		  /*
		   *    Argument[0]              
		   *      NULL
		   * 
           *  Argument_Length=0		
		   */
		   if(Argument_Length==0x00)
		   {
				nRF24L01_X_reuse_tx_payload(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_ACTIVATE:
			/*
		   *    Argument[0]              
		   *      NULL
		   * 
           *  Argument_Length=0		
		   */
		   if(Argument_Length==0x00)
		   {
				HS6200_Activate(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_R_RX_PL_WID:
		  /*
		   *    Argument[0]              
		   *      NULL
		   * 
           *  Argument_Length=0		
		   */
		   if(Argument_Length==0x00)
		   {
				pTemp[0]=SDS_R_RX_PL_WID; 
				pTemp[1]=nRF24L01_X_read_rx_payload_width(DevNum);
				USB_ACK_2_Host(DevNum,TYPE_SDS,pTemp,2);
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		case nRF24L01_W_ACK_PAYLOAD:
		  /*
		   * Argument[0]          Argument[1]                  Argument[2...n]                  
		   *  pipe num      Bytes (write ACK payload bytes)      ACK payload
		   *          
		   * Argument_Length=n
		   */
		   	if( (Argument_Length>=0x03)&& (Argument_Length<=0x34) )
			{
				for(i=0x00;i<Argument_Length-0x02;i++) pTemp[i]=Argument[i+2];    //minus pipe num and xxBytes(-2Bytes)
				nRF24L01_X_write_ack_payload(DevNum,Argument[0],pTemp,Argument[1]);  //(write ACK payload bytes)
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
		    else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
    	break;
    	case nRF24L01_W_TX_PAYLOAD_NOACK:
		  /*
		   *           Argument[0]                          Argument[1...n]
		   *  Bytes (write tx payload no ACK  bytes)           payload no ACK
		   *          
		   * Argument_Length=n;
		   */
		    if( (Argument_Length>=0x02) && (Argument_Length<=0x33) )
			{
				for(i=0x00;i<Argument_Length-0x01;i++)pTemp[i]=Argument[i+1];	//minus xxBytes
				nRF24L01_X_write_tx_payload_noack(DevNum,pTemp,Argument[0]);
				USB_ACK_2_Host(DevNum,0,NULL,0);	
			}
		    else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;	
		case nRF24L01_NOP:
		  /*
		   * Argument[0] 
		   *    NULL
		   *          
		   * Argument_Length=0;
		   */
		   if(Argument_Length==0x00)
		   {
			   pTemp[0]=HS6200_BANK0_STATUS;
			   pTemp[1]=0x01;		
			   pTemp[2]=nRF24L01_X_nop(DevNum);	//nop
			   USB_ACK_2_Host(DevNum,TYPE_REG,pTemp,3);	
		   }
		   else 
		   {
		   		#ifdef HS6200_DEBUG
	            	#if (DEBUG_OUT_ERR==LED_OUT_ERR)
			        	LED_Out_Err_Info(ERR_USB_PACKET_SPI_LENGTH);
					#else
		    			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}	
		break;
		default:
		{
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR) 
					LED_Out_Err_Info(ERR_USB_PACKET_SPI_CMD); 
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_CMD);
				#endif
			#endif
		}	
		break;
	}
}

