kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*
 * SPI 通讯协议
 *
 *  P[0]  P[1]   P[2]        P[3]     P[4]    
 *  xx     xx     xx          xx       xx         
 *  PID    Dev  PC length   CmdCode  Argument1  
 * 1Byte  1Byte  1Bytes     1Byte    0-32 Byte      
 *
 *
 */
void SPI_Protocol_Resolut(void)
{
	U8 SPI_cmd;
	U8 *SPI_Argument;
	U8 SPI_Argument_Length;
	U8 DevNum;
	DevNum=USB_Host_Out_Packet[1];
	
	SPI_cmd=USB_Host_Out_Packet[3];
	SPI_Argument=&USB_Host_Out_Packet[4];
	SPI_Argument_Length=USB_Host_Out_Packet[2]-0x01;  //minus CmdCode (1 byte)

	if(USB_Host_Out_Packet[1]==RF_DEV_0)
	{
		SPI_Mode(RF_DEV_0,SPI_cmd,SPI_Argument,SPI_Argument_Length);
	}
	else if	(USB_Host_Out_Packet[1]==RF_DEV_1)
	{
		SPI_Mode(RF_DEV_1,SPI_cmd,SPI_Argument,SPI_Argument_Length);
	}
	else
	{
	    #ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_SPI_RF_DEV); 
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPI_RF_DEV); 
			#endif
		#endif
	}
}
/*
 *   P[0]       P[1]              P[2]              P[3]         P[4]
 * PID_SPEC	    Dev		  Packet Context Length   cmd code	   Argument
 *  0x04	DEV_0/DEV_1			  xx				 xx			  xx
 *  1Byte	   1Byte		     1Byte			   1Bytes		  xx
 *
 */
void Spec_Mode(U8 DevNum,U8 Cmd,U8 *Argument,U8 Argument_Length)
{	
	U8 pTemp[0x40];

	switch(Cmd)
	{
		case SC_RF_NOP:			//返回status寄存器
			pTemp[0]=nRF24L01_X_nop(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);
		break;
		case SC_TEST_REG_RST_VAL:
			 #ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_TEST_REG_RW_CMP:
			 #ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_POWERDOWN:
			  nRF24L01_X_powerdown(DevNum);
			  USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_POWERUP:
			  nRF24L01_X_powerup(DevNum);
			  USB_ACK_2_Host(DevNum,0,NULL,0);	
		break;
		case SC_STANDBYI:
			 nRF24L01_X_standby_I(DevNum);
			 USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_STANDBYII:
			nRF24L01_X_set_ptx(DevNum);	    	//切换到PTX模式
		  	nRF24L01_X_standby_II(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_CE_HIGH:
			  nRF24L01_X_ce_high(DevNum);
			  USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_CE_LOW:
			  nRF24L01_X_ce_low(DevNum);
			  USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_CE_HIGH_PULSE:
			 nRF24L01_X_ce_high_pulse(DevNum);
			 USB_ACK_2_Host(DevNum,0,NULL,0);				
		break;
		case SC_REUSE_TX_PL:
			  nRF24L01_X_reuse_tx_payload(DevNum);
			  USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_FLUSH_TX_FIFO:
			nRF24L01_X_flush_tx(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);	
		break;
		case SC_FLUSH_RX_FIFO:
			nRF24L01_X_flush_rx(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);				
		break;
		case SC_W_TX_PAYLOAD:
			nRF24L01_X_write_tx_payload(DevNum,Argument,Argument_Length);
			USB_ACK_2_Host(DevNum,0,NULL,0);	
		break;
		case SC_W_TX_PAYLOAD_NOACK:
			nRF24L01_X_write_tx_payload_noack(DevNum,Argument,Argument_Length);
			USB_ACK_2_Host(DevNum,0,NULL,0);	
		break;
		case SC_W_ACK_PAYLOAD:
			nRF24L01_X_write_ack_payload(DevNum,Argument[0],&Argument[1],Argument_Length-0x01);	  //minus pipe num(Argumentp[0])
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case SC_ACTIVATE:		    //not finish
			 #ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_RD_PLOS_CNT:
			pTemp[0]=nRF24L01_X_get_plos_cnt(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);
		break;
		case SC_RD_ARC_CNT:
			pTemp[0]=nRF24L01_X_get_arc_cnt(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);				
		break;
		case SC_RD_RPD:
			pTemp[0]=nRF24L01_X_is_rpd(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);	
		break;
		case SC_RD_FIFO_STATUS:
			pTemp[0]=nRF24L01_X_read_fifo_status(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);
		break;
		case SC_RD_CURRENT_CONFIG_WORD:
			pTemp[0]=nRF24L01_X_read_cfg_word(DevNum);
			USB_ACK_2_Host(DevNum,TYPE_CMD,pTemp,1);
		break;
		case SC_TEST_PRESSURE:
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_TEST_DATA_COMP_DPL:
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_TEST_DATA_COMP_SPL:
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_TEST_CONT_WAVE_MODE:
			if(Argument_Length==0x01)
			{	
			nRF24L01_X_set_cont_wave(DevNum,Argument[0]);
			USB_ACK_2_Host(DevNum,0,NULL,0);
			}
		break;
		case SC_TEST_SEARCH_DIRTY_RF_CH:
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;
		case SC_TEST_SEARCH_CLEAN_RF_CH:
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif
			#endif
		break;	
		default: 
	   			{
	   				#ifdef HS6200_DEBUG
            			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
		        			LED_Out_Err_Info(ERR_USB_PACKET_SPEC_CMD);
						#else
	    					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPEC_CMD);
						#endif	
					#endif  /*HS6200_DEBUG*/
				}	
		break;
	}
}


