kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*
 *   P[0]       P[1]              P[2]              P[3]         P[4]
 * PID_SPEC	    Dev		  Packet Context Length   cmd code	   Argument
 *  0x04	DEV_0/DEV_1			  xx				 xx			  xx
 *  1Byte	   1Byte		     1Byte			   1Bytes		  xx
 *
 */
void Spec_Protocol_Resolut(void)
{
	U8 Spec_Cmd;
	U8 *Spec_Argument=NULL;
	U8 Spec_Argument_Length=0x00;
        U8 DevNum;
	DevNum=USB_Host_Out_Packet[1];
	
	HS6200_Bank0_Activate(DEV_0);  //Bank0 status
	HS6200_Bank0_Activate(DEV_1);  //Bank0 status
	
	Spec_Cmd=USB_Host_Out_Packet[3];

	if(USB_Host_Out_Packet[2]>=0x01)	  
		Spec_Argument_Length=USB_Host_Out_Packet[2]-0x01;  //minus CmdCode (1 byte)

	if(Spec_Argument_Length>=0x01)				//have argument 
		Spec_Argument=&USB_Host_Out_Packet[4];    

	if(USB_Host_Out_Packet[1]==RF_DEV_0)
	{
		Spec_Mode(DEV_0,Spec_Cmd,Spec_Argument,Spec_Argument_Length);
	}
	else if	(USB_Host_Out_Packet[1]==RF_DEV_1)
	{
		Spec_Mode(DEV_1,Spec_Cmd,Spec_Argument,Spec_Argument_Length);
	}
	else
	{
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_SPEC_RF_DEV);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SPEC_RF_DEV);
			#endif
		#endif
	}  	
}

/*----------------------------------------------09. Digital Test---------------------------------------------*/
/*
 *
 */
void Digital_Test_Mode(U8 DevNum,U8 *Cmd_Argument,U8 Cmd_Argument_Length)
{
	U8 i=0x00;
	U8 j=0x00;
	U8 Reg_Addr=0x00;
	U8 Bytes=0x00;
	U8 Reg_Val[210];   //读所有寄存器时，0x072+92=114+92=206， 这里取210
	U8 Reg_Val_Length=0x00;
	U8 Temp[5];
    U8 CH_temp=0;

	switch(Cmd_Argument[0])
	{
		case DT_SPI_TEST: 
		{
			switch(Cmd_Argument[1])
			{
				case DT_SPI_R_REGISTER:		//cmd not finish
					 #ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif
					#endif
				break;
				default:
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_DT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_CMD);
						#endif
					#endif
				break;
			}
		}
		break;
			/*
			 * Cmd_Argument[0]   Cmd_Argument[1]  Cmd_Argument[2]  
			 *	DT_REG_TEST  	       xx			   ...
			 *   1Byte				 1Byte			  1Byte
			 */
		case DT_REG_TEST:
			switch(Cmd_Argument[1])
			{

			/*
			 * Cmd_Argument[0]   Cmd_Argument[1]  Cmd_Argument[2]  Cmd_Argument[3]  ...    Cmd_Argument[2n]   Cmd_Argument[2n+1]  
			 *	DT_REG_TEST  	   DT_REG_READ		   Addr			  xxBytes		...			Addr			  xxBytes
			 *   1Byte				 1Byte			  1Byte			  1Byte			...		   1Byte			   1Byte
			 *
			 * 说明：1.	Addr   :  Register Addr. for Bank1 Register:Register Address+0x80
			 *       2. xxBytes:  为读取的字节数
			 */
				case DT_REG_READ:
					i=0x00;
					Reg_Val_Length=0x00;
					while(i<(Cmd_Argument_Length-0x02))	   //minus DT_REG_TEST(1Byte) minus  DT_REG_READ(1Byte)
					{
						Reg_Addr=Cmd_Argument[2+i];
						Bytes=Cmd_Argument[3+i];   
						i+=0x02;  
						Reg_Val[Reg_Val_Length]=Reg_Addr;		   //存放寄存器地址 1Byte
						Reg_Val[Reg_Val_Length+0x01]=Bytes;	   //存放读取寄存器的宽度 1Byte

						if(	(Reg_Addr & HS6200_BANK_BIT)==HS6200_BANK1 )  //BANK1
						{
							HS6200_Bank1_Activate(DevNum);
							Reg_Addr&=~HS6200_BANK_BIT;	
						}
						else HS6200_Bank0_Activate(DevNum);		          //Bank0           
                            
						if(Bytes>0x01)	   
						{
							nRF24L01_X_read_reg_multibytes(DevNum,Reg_Addr,Temp,Bytes);  //read multibytes	 LSByte First,MSB last
							for(j=0x00;j<Bytes;j++)Reg_Val[(0x01+0x01+Reg_Val_Length)+j]=Temp[Bytes-0x01-j];	//Addr + Bytes total 2 Bytes  -->out: MSB First,LSB last 
						}
						else 
							Reg_Val[(0x01+0x01+Reg_Val_Length)]=nRF24L01_X_read_reg(DevNum,Reg_Addr); //read one byte
								
					   	Reg_Val_Length+=(0x01+0x01+Bytes);  //Addr+Bytes+(register data)Bytes
					}
					USB_ACK_2_Host(DevNum,TYPE_REG,Reg_Val,Reg_Val_Length);	
				break;
				case DT_REG_READ_ALL:	   
					Reg_Val_Length=HS6200_Read_All_Register(DevNum,Reg_Val);
					USB_ACK_2_Host(DevNum,TYPE_REG,Reg_Val,Reg_Val_Length);
				break;
				case DT_REG_WRITE:		  
					i=0x00;
					Bytes=0x00;
					while(i<(Cmd_Argument_Length-0x02))     //minus DT_REG_TEST(1Byte) minus  DT_REG_WRITE(1Byte). total 2Bytes
					{
						Reg_Addr=Cmd_Argument[0x02+i];       //register addr . 	DT_REG_TEST + DT_REG_WRITE  total 2Bytes
						Bytes=Cmd_Argument[0x02+0x01+i];	 //register data width 		DT_REG_TEST + DT_REG_WRITE+ Reg_Addr. total 3Bytes  
						for(j=0x00;j<Bytes;j++)Reg_Val[j]=Cmd_Argument[0x02+0x01+0x01+i+Bytes-0x01-j];   //register context   DT_REG_TEST + DT_REG_WRITE + register Address + Bytes  	
						if ( (Reg_Addr & HS6200_BANK_BIT) == HS6200_BANK1 )
						{
						    HS6200_Bank1_Activate(DevNum);
							Reg_Addr&=~HS6200_BANK_BIT;	
						}
						else //Bank0
                        {
                            HS6200_Bank0_Activate(DevNum);		          
						
                            if(Reg_Addr==nRF24L01_RX_ADDR_P0) for(j=0x00;j<Bytes;j++)Address_Pipe0[j]=Reg_Val[j];         //存储Pipe0地址
                        }
                        if(Bytes>0x01)			  //write multibytes
						{
							nRF24L01_X_write_reg_multibytes(DevNum,Reg_Addr,Reg_Val,Bytes);			
						}
						else					  //write one byte
						{
							 nRF24L01_X_write_reg(DevNum,Reg_Addr,Reg_Val[0]);
						}	
						i+=(0x01+0x01+Bytes);	   //(reg addr+Bytes+context)'Bytes=1Byte+1Byte+Bytes    
					}
                    if((Dev_Flag[DevNum]==MAC6200_DEV))
                    {
                       HS6200_Bank0_Activate(DevNum);
                       CH_temp = nRF24L01_X_read_reg(DEV_0, nRF24L01_RF_CH);
                       MAC6200_set_freq(2400+CH_temp); 
                    }
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case DT_REG_WRITE_ALL_0:    //cmd not finish
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif
					#endif
				break;
				case DT_REG_WRITE_ALL_1:   //cmd not finish
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif
					#endif
				break;
				case DT_REG_RESET: 	        //software reset
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif
					#endif
				break;
				case DT_REG_RST_VAL:	    //reset register value
					if(0x02==Cmd_Argument_Length)
					{
						nRF24L01_X_flush_rx(DevNum);
						nRF24L01_X_flush_tx(DevNum);
						HS6200_Rst_Bank0_All_Register(DevNum);
						HS6200_Rst_Bank1_All_Register(DevNum);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						 #ifdef HS6200_DEBUG
							#if (DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_DT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_LENGTH);
							#endif
						#endif
					}
				break;
				case DT_REG_R_VS_W:				  //cmd not finish
						 #ifdef HS6200_DEBUG
							#if (DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
							#endif
						#endif
				break;
				default:
					 #ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_DT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_CMD);
						#endif
					#endif
				break;
			}
		break;
		case DT_MISC_TEST:
		{
			switch(Cmd_Argument[1])
			{
				case DT_MISC_CE_HIGH:
					nRF24L01_X_ce_high(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case DT_MISC_CE_LOW:
					nRF24L01_X_ce_low(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case DT_MISC_CE_HIGH_PULSE:
					nRF24L01_X_ce_high_pulse(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case DT_MISC_SOFT_RESET:
					HS6200_Soft_Rst(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				default:
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_DT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_CMD);
						#endif
					#endif
				break;
			}
		}
		break;
		case DT_PIPE_TEST:			  //cmd not finish
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
					#endif
			#endif
		break;
		default:						        //cmd err
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_DT_CMD);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_CMD);
				#endif
			#endif
		break;
	}	
}


