kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
/*
 *	     P[0]            P[1]            P[2]			   	   P[3]
 *	PID_Digital_Test	 Dev	  packet context length		DT_Cmd Code
 *      0x08          0x00/0x01		      xx				    xx
 *     1Byte            1Byte           1Byte			      1Byte
 *
 */

void Ditital_Test_Protocol_Resolut(void)
{
	U8 DevNum=0x00;
	U8 Cmd_Argument[MAX_OUT_PACKET_LENGTH-0x03];   //minus PID_Digital_Test(1Byte)-Dev(1Byte)-PCL(1Byte)
	U8 Cmd_Argument_Length=0x00;
	U8 i;
	Cmd_Argument_Length=USB_Host_Out_Packet[2];

	if( (Cmd_Argument_Length>=0x01) && (Cmd_Argument_Length<=MAX_OUT_PACKET_LENGTH-0x03) )   //length is err?
	{	
		if( (RF_DEV_0!=USB_Host_Out_Packet[1]) && (RF_DEV_1!=USB_Host_Out_Packet[1]) )	  //dev err
		{
			#ifdef HS6200_DEBUG
				#if(DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_DT_RF_DEV);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_RF_DEV);
				#endif
			#endif  /*HS6200_DEBUG*/
		}
		else																		//dev is right
		{ 
			DevNum=USB_Host_Out_Packet[1];         //get dev num               
			Cmd_Argument_Length=USB_Host_Out_Packet[2];			   //get cmd argument length
			for(i=0x00;i<Cmd_Argument_Length;i++) Cmd_Argument[i]=USB_Host_Out_Packet[3+i];	 //get cmd argument
			Digital_Test_Mode(DevNum,Cmd_Argument,Cmd_Argument_Length);
		}
	} 	
	else	     // length err
	{
		#ifdef HS6200_DEBUG
			#if(DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_DT_LENGTH);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DT_LENGTH);
			#endif
		#endif  /*HS6200_DEBUG*/
	}
}

/*-----------------------------------------------Analog Test----------------------------------------------------*/
/*
 *       P[0]         P[1]            P[2]			    p[3]         p[4]
 *	PID_ANALOG_TEST	  Dev     packet context length     mode       Argument 
 *		0x09		0x00/0x01		   xx			   0x01-0x08      xx
 *      1Byte		 1Byte			  1Byte				1Byte	    n Byte
 */
void Analog_Test_Mode(U8 DevNum,U8 *Mode_Argument, U8 Mode_Argument_Length)
{
	U8 Temp[5];   //used to send data
	U8 Test_Mode=0x00;
	U8 i=0x00;

	if(Mode_Argument_Length>=0x02)
	{
		Test_Mode=Mode_Argument[0];
		switch(Test_Mode)
		{
		//------------------------1.Analog Test Test point configuration---------------------------
		case AT_TEST_PT_CFG:	             
			if(0x02==Mode_Argument_Length)
			{
				switch(Mode_Argument[1])    
				{
				case AT_TPC_NONE:
					 HS6200_Test_Disable(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_LNA_bias:
					 HS6200_Test_Point_Config_Lna_Bias(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_Mixer_CM_voltage: 
					HS6200_Test_Point_Config_Mix_CM_Vol(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_TIA_I_CM_voltage:
					HS6200_Test_Point_Config_TIA_I_CM_Vol(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_TIA_Q_CM_voltage:
					 HS6200_Test_Point_Config_TIA_Q_CM_Vol(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_TIA_output:
					 HS6200_Test_Point_Config_TIA_Output(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_1_2v_LDO_of_LO:
					 HS6200_Test_Point_Config_1V2_LDO(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_1_3v_LDO_of_LO:
					 HS6200_Test_Point_Config_1V3_LDO(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_DIV2_CM_voltage:
					 HS6200_Test_Point_Config_Div2_CM_Vol(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_LO_control_voltage:
					 HS6200_Test_Point_Config_LO_Ctrl_Vol(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_FBCLK_of_LO:
					 HS6200_Test_Point_Config_Fbclk_LO(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_Crystal_output:
					 HS6200_Test_Point_Config_Crystal_Output(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_TPC_Filter_output:
					 HS6200_Test_Point_Config_Filter_Output(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                     
/* HS6200B1 wangs 2013-12-25*/
                case HS6200B1_AT_TPC_NONE:
					 HS6200_Test_Disable(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Fbclk_b:
                     HS6200B1_Test_Point_Config_Fbclk_b(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Crystal_clock:
                     HS6200B1_Test_Point_Config_Crystal_clock(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Old_pkdet_ip:
                     HS6200B1_Test_Point_Config_Old_pkdet_ip(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Old_pkdet_qp:
                     HS6200B1_Test_Point_Config_Old_pkdet_qp(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_New_pkdet_1:
                     HS6200B1_Test_Point_Config_New_pkdet_1(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_New_pkdet_0:
                     HS6200B1_Test_Point_Config_New_pkdet_0(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Filter_ip:
                     HS6200B1_Test_Point_Config_Fiter_ip(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Filter_in:
                     HS6200B1_Test_Point_Config_Fiter_in(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Filter_qp:
                     HS6200B1_Test_Point_Config_Fiter_qp(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Filter_qn:
                     HS6200B1_Test_Point_Config_Fiter_qn(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_ip:
                     HS6200B1_Test_Point_Config_Mixer_ip(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_in:
                     HS6200B1_Test_Point_Config_Mixer_in(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_qp:
                     HS6200B1_Test_Point_Config_Mixer_qp(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_qn:
                     HS6200B1_Test_Point_Config_Mixer_qn(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_VCO_LDO:
                     HS6200B1_Test_Point_Config_VCO_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_LO_BUF_LDO:
                     HS6200B1_Test_Point_Config_LO_BUF_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Bandgap:
                     HS6200B1_Test_Point_Config_Bnadgap(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Vctrl:
                     HS6200B1_Test_Point_Config_Vctrl(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_LNA_bias:
                     HS6200B1_Test_Point_Config_LNA_bias_B1(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_bias:
                     HS6200B1_Test_Point_Config_Mixer_bias(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Mixer_LDO:
                     HS6200B1_Test_Point_Config_Mixer_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_LNA_LDO:
                     HS6200B1_Test_Point_Config_LNA_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_Filter_LDO:
                     HS6200B1_Test_Point_Config_Filter_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                case HS6200B1_AT_TPC_XTAL_BUF_LDO:
                     HS6200B1_Test_Point_Config_XTAL_BUF_LDO(DevNum);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
/*END  wangs 2013-12-25*/                              
                
				default:
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif
				break; 
				}
			}
			else
			{
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
					#endif
				#endif
			} 		
		break;
		//--------------------------2.Analog Test frequency configuration------------------------------
		case AT_FREQ_CFG:	  
		{
		 	switch(Mode_Argument[1])
			{
			case AT_FC_SET_FREQ:
				 /*	    Mode_Argument[2]   Mode_Argument[3]    Mode_Argument[4]      Mode_Argument[5]--Mode_Argument[6]
				  * 	 integer MSByte	    integer LSByte	   fraction MSByte                 fraction LSByte			   
				  */
				 HS6200_Set_Freq(DevNum,&Mode_Argument[2],Mode_Argument_Length-0x02);   //minus Mode_Argument[0] and Mode_Argument[1], 2Bytes  
				 USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_SDM_ON:
				 HS6200_Freq_Cfg_SDM_On(DevNum);
				 USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_SDM_OFF:
				HS6200_Freq_Cfg_SDM_Off(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_DITHER_ON:
				HS6200_Freq_Cfg_SDM_Dither_On(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_DITHER_OFF:
				HS6200_Freq_Cfg_SDM_Dither_Off(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_DITHER_STAGE_1:
				HS6200_Freq_Cfg_SDM_Dither_Stage(DevNum,0x01);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_DITHER_STAGE_2:
				HS6200_Freq_Cfg_SDM_Dither_Stage(DevNum,0x02);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_FO_160K:
				HS6200_Freq_Cfg_Freq_Offset_160KHz(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_FO_250K:
				HS6200_Freq_Cfg_Freq_Offset_250KHz(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_FO_320K:
				HS6200_Freq_Cfg_Freq_Offset_320KHz(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_RF_DR_250K:
				HS6200_Data_Rate_250K(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_RF_DR_500K:
				HS6200_Data_Rate_500K(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_RF_DR_1M:
				HS6200_Data_Rate_1M(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_RF_DR_2M:
				HS6200_Data_Rate_2M(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_IF:
				if(Mode_Argument_Length==0x05)	  //中频占三个字节 + L1 Cmd(1Byte) + L2 Cmd(1Byte) = 5Bytes
				{
					for(i=0x00;i<(Mode_Argument_Length-0x02);i++) Temp[i]=Mode_Argument[2+i];
					HS6200_IF_Freq(DevNum,Temp,Mode_Argument_Length-0x02);   //minus Mode_Argument[0] and Mode_Argument[1]	 2Bytes
			    	USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else 							//length err
				{
					#ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif  /*HS6200_DEBUG*/	
				}
			break;
			case AT_FC_AB_CNT_REG:
			/*
			 * first A_Cnt register value,then B_Cnt register value
			 */
				if(Mode_Argument_Length==0x04)	//A_Cnt(1Byte)+ B_Cnt(1Byte)+ L1 Cmd + L2 Cmd = 4Bytes 
				{
					HS6200_AB_Cnt(DevNum,Mode_Argument[2],Mode_Argument[3]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else 	   //length err
				{
					#ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif  /*HS6200_DEBUG*/	
				}
			break;
			case AT_FC_PLL_TEST_EN_ON:
				HS6200_PLL_Test_En_On(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_FC_PLL_TEST_EN_OFF:	 
			     HS6200_PLL_Test_En_Off(DevNum);
				 USB_ACK_2_Host(DevNum,0,NULL,0);
			default:
				#ifdef HS6200_DEBUG
					#if(DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
					#endif
				#endif  /*HS6200_DEBUG*/
			break;
			}
		}		
		break;
		//---------------------------3.Analog Test Rx Gain configuration-----------------------------
		/*
		 * 	mode_argument[1]    mode_argument[2]
		 *	   LNA gain             filter gain
		 *    1Byte					  1Byte
		 */
		case AT_RX_GAIN_CFG:	    //3.Rx Gain Config
			{
				switch(Mode_Argument[1])
				{
				case AT_RXGC_AGC_GAIN_MN_ON:
					HS6200_Agc_Gain_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_AGC_GAIN_MN_OFF:
					HS6200_Agc_Gain_Mn_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
			 	case AT_RXGC_LNA_GAIN_4dB:
					HS6200_LNA_Gain_4dB(DevNum);		    //LNA gain
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_LNA_GAIN_16dB:
					HS6200_LNA_Gain_16dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_LNA_GAIN_28dB:
					HS6200_LNA_Gain_28dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_LNA_GAIN_40dB:
					HS6200_LNA_Gain_40dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
                
/*HS6200B1  wangs 2013-12-25*/
                case HS6200B1_AT_RXGC_LNA_GAIN_4dB:
					HS6200B1_LNA_Gain_4dB(DevNum);		    //HS6200B1 LNA gain
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case HS6200B1_AT_RXGC_LNA_GAIN_16dB:
					HS6200B1_LNA_Gain_16dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case HS6200B1_AT_RXGC_LNA_GAIN_28dB:
					HS6200B1_LNA_Gain_28dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case HS6200B1_AT_RXGC_LNA_GAIN_40dB:
					HS6200B1_LNA_Gain_40dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
 /*END wangs 2013-12-25*/
                
