kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
				case AT_RXGC_FILTER_GAIN_6dB:
					HS6200_Gain_Filter_6dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_FILTER_GAIN_8dB:
					HS6200_Gain_Filter_8dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_10dB:
					HS6200_Gain_Filter_10dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_12dB:
					HS6200_Gain_Filter_12dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_14dB:
					HS6200_Gain_Filter_14dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_16dB:
					HS6200_Gain_Filter_16dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_18dB:
					HS6200_Gain_Filter_18dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_RXGC_FILTER_GAIN_20dB:
					HS6200_Gain_Filter_20dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_22dB:
					HS6200_Gain_Filter_22dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_24dB:
					HS6200_Gain_Filter_24dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 						
				case AT_RXGC_FILTER_GAIN_26dB:
					HS6200_Gain_Filter_26dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 					
				case AT_RXGC_FILTER_GAIN_28dB:
					HS6200_Gain_Filter_28dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 				 
				case AT_RXGC_FILTER_GAIN_30dB:
					HS6200_Gain_Filter_30dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);	
				break; 
				case AT_RXGC_FILTER_GAIN_32dB:
					HS6200_Gain_Filter_32dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_34dB:
					HS6200_Gain_Filter_34dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_36dB:
					HS6200_Gain_Filter_36dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_38dB:
					HS6200_Gain_Filter_38dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_40dB:
					HS6200_Gain_Filter_40dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_42dB:
					HS6200_Gain_Filter_42dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_44dB:
					HS6200_Gain_Filter_44dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				case AT_RXGC_FILTER_GAIN_46dB:
					HS6200_Gain_Filter_46dB(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break; 
				default:
					#ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif  /*HS6200_DEBUG*/
				break;
				}
			}
		break;
		//------------------------4.Analog Test Peak Detector threshold---------------------------------
		case AT_PEAK_DTT_THR:             
            switch(Mode_Argument[1])
            {
                case AT_PDT_50mV:
                    HS6200_Peak_Detector_Power_50mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case AT_PDT_100mV:
                    HS6200_Peak_Detector_Power_100mV(DevNum);
                    USB_ACK_2_Host(DevNum,NULL,0,0);
                break;
                case AT_PDT_150mV:
                    HS6200_Peak_Detector_Power_150mV(DevNum);
                    USB_ACK_2_Host(DevNum,NULL,0,0);
                break;
                case AT_PDT_200mV:
                    HS6200_Peak_Detector_Power_200mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case AT_PDT_250mV:
                    HS6200_Peak_Detector_Power_250mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case AT_PDT_300mV:
                    HS6200_Peak_Detector_Power_300mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case AT_PDT_350mV:
                    HS6200_Peak_Detector_Power_350mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case AT_PDT_400mV:
                    HS6200_Peak_Detector_Power_400mV(DevNum);
                    USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
//HS6200B1   wangs 2013-12-27
                case HS6200B1_AT_PDT_AGC_SEL_OLD:
                     HS6200B1_Old_Peak_Detector_Activate(DevNum);     //Activate Old Peak Detector : agc_sel=0
                     USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case HS6200B1_AT_PDT_AGC_SEL_NEW:
                     HS6200B1_New_Peak_Detector_Activate(DevNum);     //Activate New Peak Detector : agc_sel=1
                     USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
                case HS6200B1_AT_PDT_VH_VL:                           
                     HS6200B1_New_Peak_Detector_VH_VL_Configuration(DevNum,Mode_Argument[2]);
                     USB_ACK_2_Host(DevNum,0,NULL,0);
                break;
//END wangs  2013-12-27               
                default:
                    #ifdef HS6200_DEBUG
                        #if(DEBUG_OUT_ERR==LED_OUT_ERR)
                            LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
                        #else
                            USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
                        #endif
                    #endif  /*HS6200_DEBUG*/
                break;
            }
		break;
		//---------------------------5.Analog Test PA power configuration-----------------------------
		case AT_PA_PWR_CFG:
		switch(Mode_Argument[1])
		{
		case AT_PAPC_n18dBm:
			HS6200_PA_Power_n18dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case AT_PAPC_n12dBm:
			HS6200_PA_Power_n12dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case AT_PAPC_n6dBm:
			HS6200_PA_Power_n6dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case AT_PAPC_0dBm:
			HS6200_PA_Power_0dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case AT_PAPC_5dBm:
			HS6200_PA_Power_5dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
        
// HS6200B1  wangs 2013-12-27
        case HS6200B1_AT_PAPC_n18dBm:
			HS6200B1_PA_Power_n18dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case HS6200B1_AT_PAPC_n12dBm:
			HS6200B1_PA_Power_n12dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case HS6200B1_AT_PAPC_n6dBm:
			HS6200B1_PA_Power_n6dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case HS6200B1_AT_PAPC_0dBm:
			HS6200B1_PA_Power_0dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
		case HS6200B1_AT_PAPC_5dBm:
			HS6200B1_PA_Power_5dBm(DevNum);
			USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
        case HS6200B1_AT_PAPC_PA_VOLTAGE_1V8:
            HS6200B1_PA_Power_Voltage_1V8(DevNum);
            USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
        case HS6200B1_AT_PAPC_PA_VOLTAGE_3V:
            HS6200B1_PA_Power_Voltage_3V(DevNum);
            USB_ACK_2_Host(DevNum,0,NULL,0);
		break;
//END wangs 2013-12-27

		default:
			#ifdef HS6200_DEBUG
				#if(DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
				#endif
			#endif  /*HS6200_DEBUG*/
		break; 
		}		
		break;
		//-----------------------------6. Analog Test Calibration manual mode----------------------------- 
		/*
		 * Mode_Argument[1]	    Mode_Argument[2]
		 * 
		 *   1Byte			    	1Byte
		 */
		case AT_CAL_MAN_MODE:
			 switch(Mode_Argument[1])
			 {
			 	case AT_CMM_CTUNING_MN_ON:
					 HS6200_VCO_Ctuning_Calb_Mn_On(DevNum);
					 USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_CTUNING_MN_OFF:
					HS6200_VCO_Ctuning_Calb_Mn_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case  AT_CMM_FTUNING_MN_ON:
					HS6200_VCO_Ftuning_Calb_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_FTUNING_MN_OFF:
					HS6200_VCO_Ftuning_Calb_Mn_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_VCO_LDO_CAL_MN_ON:
					HS6200_VCO_LDO_Calb_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_VCO_LDO_CAL_MN_OFF:
					HS6200_VCO_LDO_Calb_Mn_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_DAC_RANGE_MN_ON:
					HS6200_DAC_Range_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_DAC_RANGE_MN_OFF:
					HS6200_DAC_Range_Mn_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_DOC_DAC_MN_ON:
					HS6200_DOC_DAC_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_DOC_DAC_MN_OFF:
					HS6200_DOC_DAC_Mn_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CMM_CARRIER_CAL_MN:
					if(0x03==Mode_Argument_Length)	    //3Byte length=L1 Cmd + L2 Cmd + Argument
					{
						HS6200_Carrier_Calb(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else if(0x02==Mode_Argument_Length)	 //2Byte length=L1 Cmd + L2 Cmd 
					{
						HS6200_Calibration(DevNum);
					}
					else 
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/					
					} 
				break;
				case AT_CMM_CTUNING_REG_R:
					 Temp[0]=HS6200_Read_VCO_Ctuning(DevNum);
					 USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_CTUNING_REG_W:
					if(0x03==Mode_Argument_Length)	 //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_VCO_Ctuning(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/	
					}
				break;
				case AT_CMM_FTUNING_REG_R:
					Temp[0]=HS6200_Read_VCO_Ftuning(DevNum);
					USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_FTUNING_REG_W:
					if(0x03==Mode_Argument_Length)	  //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_VCO_Ftuning(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else			//length err
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/	
					}
				break;
				case AT_CMM_VCO_LDO_CAL_REG_R:
					Temp[0]=HS6200_Read_VCO_LDO_Calb(DevNum);
					USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_VCO_LDO_CAL_REG_W:
					if(0x03==Mode_Argument_Length) //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_VCO_LDO_Calb(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/	
					}
				break;
				case AT_CMM_DAC_RANGE_R:
					Temp[0]=HS6200_Read_DAC_Gain(DevNum);
					USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_DAC_RANGE_W:
					if(0x03==Mode_Argument_Length) //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_DAC_Gain(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/	
					}
				break;
				case AT_CMM_DOC_DACI_R:
					Temp[0]=HS6200_Read_DC_Offset_I(DevNum);
					USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_DOC_DACI_W:
					if(0x03==Mode_Argument_Length) //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_DC_Offset_I(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/
					}
				break;
				case AT_CMM_DOC_DACQ_R:
					Temp[0]=HS6200_Read_DC_Offset_Q(DevNum);
					USB_ACK_2_Host(DevNum,TYPE_CMD,Temp,1);
				break;
				case AT_CMM_DOC_DACQ_W:
					if(0x03==Mode_Argument_Length) //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
					{
						HS6200_Write_DC_Offset_Q(DevNum,Mode_Argument[2]);
						USB_ACK_2_Host(DevNum,0,NULL,0);
					}
					else
					{
						#ifdef HS6200_DEBUG
							#if(DEBUG_OUT_ERR==LED_OUT_ERR)
								LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
							#else
								USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
							#endif
						#endif  /*HS6200_DEBUG*/
					}
				break;
				default:
					#ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif  /*HS6200_DEBUG*/
				break;
			 }
		break;
	
		//--------------------7.Analog Test Continuous carrier Transmit------------------------- 
		/*
		 * Mode_Argument[1]    
		 *
		 */
		case AT_CONT_CARRIER_TX:
			switch(Mode_Argument[1])
			{
				case AT_CCT_CONT_WAVE_START:
					HS6200_Cont_Wave_Start(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_CONT_WAVE_STOP:
					HS6200_Cont_Wave_Stop(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);   
				break;
				case AT_CCT_PLL_DAC_ON:
					HS6200_PLL_DAC_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_DAC_OFF:
					HS6200_PLL_DAC_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_BP_CP_DIO_ON:
					HS6200_Bp_Cp_Diox_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_BP_CP_DIO_OFF:
					HS6200_Bp_Cp_Diox_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_VC_DET_ON:
					HS6200_Vc_Det_On(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_VC_DET_OFF:
					HS6200_Vc_Det_Off(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_ICP_SEL_80uA:
					HS6200_PLL_Icp_Sel_80uA(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_ICP_SEL_120uA:
					HS6200_PLL_Icp_Sel_120uA(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_ICP_SEL_160uA:
					HS6200_PLL_Icp_Sel_160uA(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_ICP_SEL_200uA:
					HS6200_PLL_Icp_Sel_200uA(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;									
				case AT_CCT_PLL_VDIV2_SEL_550mV:
					HS6200_PLL_Vdiv2_Sel_550mV(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_VDIV2_SEL_600mV:
					HS6200_PLL_Vdiv2_Sel_600mV(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_VDIV2_SEL_650mV:
					HS6200_PLL_Vdiv2_Sel_650mV(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case AT_CCT_PLL_VDIV2_SEL_700mV:
					HS6200_PLL_Vdiv2_Sel_700mV(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				default:
					#ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
						#endif
					#endif  /*HS6200_DEBUG*/
				break; 
			}	
		break;
		//-----------------------8.continuous test partten tx -----------------------------
		case AT_CONT_TESTPAT_TX:     
		{
			switch(Mode_Argument[1])
			{
			case AT_CTT_TESTPAT_START:
				HS6200_Cont_Test_Pat_Tx_Start(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_CTT_TESTPAT_STOP:
				HS6200_Cont_Test_Pat_Tx_Stop(DevNum);
				USB_ACK_2_Host(DevNum,0,NULL,0);
			break;
			case AT_CTT_TESTPAT:
				if(Mode_Argument_Length==0x03) //L1Cmd(1Byte)+L2Cmd(1Byte)+set argument(1Byte)=3Bytes
				{
					HS6200_Cont_Test_Pat(DevNum,Mode_Argument[2]);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				}
				else 
				{
					 #ifdef HS6200_DEBUG
						#if(DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
						#endif
					#endif  /*HS6200_DEBUG*/
				}
			break;
			case AT_CTT_TESTPAT_PN:
				USB_ACK_2_Host(DevNum,0,NULL,0);	//AT_CTT_TEST_PN 的ACK
				USB_Host_Out_Flag=USB_HOST_OUT_FLAG_C8051F_USED;   //置标志位，可以接收AT_CTT_TESTPAT_STOP命令
				HS6200_Test_Pattern_Pseudo_Random_Num(DevNum);
				HS6200_Cont_Test_Pat_Tx_Stop(DevNum);   //发送停止命令后，才能执行到此
				USB_ACK_2_Host(DevNum,0,NULL,0);	//AT_CTT_TESTPAT_STOP的ACK
			break;
			default:
				#ifdef HS6200_DEBUG
					#if(DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
					#endif
				#endif  /*HS6200_DEBUG*/
			break; 
			}
		}
		break;
		default:
			#ifdef HS6200_DEBUG
				#if(DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
				#endif
			#endif  /*HS6200_DEBUG*/
		break;
		}
	}
	else
	{
		#ifdef HS6200_DEBUG
			#if(DEBUG_OUT_ERR==LED_OUT_ERR)
				LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
			#endif
		#endif  /*HS6200_DEBUG*/
	}
}
/*
 *       P[0]         P[1]            P[2]			    p[3]         p[4]
 *	PID_ANALOG_TEST	  Dev     packet context length     mode       Argument 
 *		0x09		0x00/0x01		   xx			   0x01-0x08      xx
 *      1Byte		 1Byte			  1Byte				1Byte	    n Byte
 */
void Analog_Test_Protocol_Resolut(void)
{	
	U8 Mode_Argument[10];
	U8 Mode_Argument_Length=0x00;
	U8 DevNum;
	U8 i=0x00;
	DevNum=USB_Host_Out_Packet[1];

	if( (DevNum==DEV_0) || (DevNum==DEV_1)  ) //dev right
	{
		Mode_Argument_Length=USB_Host_Out_Packet[2];
		if(Mode_Argument_Length<10)
		{
	    	for(i=0x00;i<Mode_Argument_Length;i++)Mode_Argument[i]=USB_Host_Out_Packet[3+i];
			if(Mode_Argument[0]<=0x08)Analog_Test_Mode(DevNum,Mode_Argument,Mode_Argument_Length);   //analog test 8 comand code totle
			else 				   //cmd code err
			{
				#ifdef HS6200_DEBUG
	    			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
	        			LED_Out_Err_Info(ERR_USB_PACKET_AT_CMD);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_CMD);
					#endif	
				#endif  /*HS6200_DEBUG*/
			}
		}
		else 			  //length err
		{
				#ifdef HS6200_DEBUG
	    			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
	        			LED_Out_Err_Info(ERR_USB_PACKET_AT_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/	
		}
	}
	else	    //dev err
	{
	 	#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
    			LED_Out_Err_Info(ERR_USB_PACKET_AT_RF_DEV);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_AT_RF_DEV);
			#endif	
		#endif  /*HS6200_DEBUG*/	
	}	
}
void System_Protocol_Resolut(void)	    //没有实现
{
	U8 DevNum;
	DevNum=USB_Host_Out_Packet[1];
	#ifdef HS6200_DEBUG
		#if (DEBUG_OUT_ERR==LED_OUT_ERR)
    		LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
		#else
			USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
		#endif	
	#endif  /*HS6200_DEBUG*/		
}

void Set_Mode(U8 DevNum,U8 *Cmd_Argument,U8 Cmd_Argument_Length)
{
	U8 Temp[5];
	U8 i;
	U8 Addr_Width;
	Cmd_Argument_Length=Cmd_Argument_Length;
	switch(Cmd_Argument[0])
	{
		case  TYPE_REG :     //not finish
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif	
	        #endif  /*HS6200_DEBUG*/		
		break;
		case TYPE_PLD:      //not finish
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif	
			#endif  /*HS6200_DEBUG*/		
		break;
		case TYPE_SDS:      
			switch(Cmd_Argument[1])
			{
				case SDS_CONFIG:
					HS6200_Bank0_Activate(DevNum);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_CONFIG,Cmd_Argument[2]); 	
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_SETUP_RETR,Cmd_Argument[3]);
				    nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RF_CH,Cmd_Argument[4]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RF_SETUP,Cmd_Argument[5]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_FEATURE,Cmd_Argument[6]);
					
					if( Cmd_Argument[7] & BIT7 )ce_low_befor_write=1;
					else ce_low_befor_write=0;
					if( Cmd_Argument[7] & BIT6) Cal_after_Ack=1;
					else Cal_after_Ack=0;
					if(Cmd_Argument[7] & BIT5) flush_tx_when_max_rt=1;
					else flush_tx_when_max_rt=0;
					if( Cmd_Argument[7]& BIT4) nRF24L01_X_ce_high(DevNum);
					else nRF24L01_X_ce_low(DevNum);	
                    if( Cmd_Argument[7] & BIT3)Tx_By_CE_High=1;
					else Tx_By_CE_High=0x00;
					if(Cmd_Argument[7]&BIT2)Nop_After_W_Tx_Payload=0x01;
					else Nop_After_W_Tx_Payload=0x00;
								
//					if (Cmd_Argument[8] & BIT7) nRF24L01_1_EI=0;
//				    else if(Dev_Flag[DEV_1]==DEV_NONE)	  // 如果是DEV_NONE 则不能打开xx_EI，因为打开后，程序进入中断，就会死在中断里
//						nRF24L01_1_EI=0;
//					else nRF24L01_1_EI=1;
//					if(Cmd_Argument[8] & BIT6)	nRF24L01_0_EI=0;
//					else if(Dev_Flag[DEV_0]==DEV_NONE)
//						nRF24L01_0_EI=0;
//					else nRF24L01_0_EI=1;
					 
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_SETUP_AW,Cmd_Argument[9]);
                   
					switch(Cmd_Argument[9])
					{
						case nRF24L01_AW_5_BYTES: 
							Addr_Width=0x05;
							for(i=0x00;i<Addr_Width;i++)Temp[i]=Cmd_Argument[10+Addr_Width-0x01-i]; 
							nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_TX_ADDR,Temp,Addr_Width);
						break;
						case nRF24L01_AW_4_BYTES:
							Addr_Width=0x04;
							for(i=0x00;i<Addr_Width;i++)Temp[i]=Cmd_Argument[10+Addr_Width-0x01-i]; 
							nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_TX_ADDR,Temp,Addr_Width);
						break;
						case nRF24L01_AW_3_BYTES:
							Addr_Width=0x03;
						    for(i=0x00;i<Addr_Width;i++)Temp[i]=Cmd_Argument[10+Addr_Width-0x01-i]; 
							nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_TX_ADDR,Temp,Addr_Width); 
						break;
						default:
							#ifdef HS6200_DEBUG
								#if (DEBUG_OUT_ERR==LED_OUT_ERR)
									LED_Out_Err_Info(ERR_USB_PACKET_SET_DATA);
								#else
									USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SET_DATA);
								#endif	
							#endif  /*HS6200_DEBUG*/				
						break;
					}									
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_EN_RXADDR,Cmd_Argument[15]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_EN_AA,Cmd_Argument[16]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_DYNPD,Cmd_Argument[17]);
					
					
