kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
					for(i=0x00;i<Addr_Width;i++)
                    {
                        Temp[i]=Cmd_Argument[18+Addr_Width-0x01-i]; 
                        Address_Pipe0[i]=Temp[i];  //存储Pipe0
                    }
					nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0,Temp,Addr_Width);
                    
					
					if(Dev_Flag[DevNum]==nRF24L01_DEV)                  //nRF24L01 dev
					{
						for(i=0x00;i<Addr_Width;i++)Temp[i]=Cmd_Argument[23+Addr_Width-0x01-i]; 
						nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Temp,Addr_Width);
					}	
					else if(Dev_Flag[DevNum]==HS6200_DEV)               //HS6200 
					{
						nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,&Cmd_Argument[23],1);
					}
					nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P2,&Cmd_Argument[28],1);
					nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P3,&Cmd_Argument[29],1);
					nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P4,&Cmd_Argument[30],1);
					nRF24L01_X_write_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P5,&Cmd_Argument[31],1);
					
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P0,Cmd_Argument[32]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P1,Cmd_Argument[33]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P2,Cmd_Argument[34]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P3,Cmd_Argument[35]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P4,Cmd_Argument[36]);
					nRF24L01_X_write_reg(DevNum,HS6200_BANK0_RX_PW_P5,Cmd_Argument[37]);
					
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case SDS_MCU:    //not finish
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif	
					#endif  /*HS6200_DEBUG*/						
				break;
				case SDS_FLUSH_TX_WHEN_MAX_RT:
					if(Cmd_Argument[2])	flush_tx_when_max_rt=0x01;
					else flush_tx_when_max_rt=0x00;
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case SDS_TRANSMIT_BY_CE_HIGH:   //发送方式
					if(Cmd_Argument[2])Tx_By_CE_High=0x01;   //CE为高发送
					else Tx_By_CE_High=0x00;                 //CE为低发送
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case SDS_NOP_AFTER_W_TX_PAYLOAD:
					if(Cmd_Argument[2])Nop_After_W_Tx_Payload=0x01;
					else Nop_After_W_Tx_Payload=0x00;
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;	
				default:
				break;
			} 
		break;
		case TYPE_CMD:
			switch(Cmd_Argument[1])
			{
				case CMD_MANUAL_RETR:
					nRF24L01_X_reuse_tx_payload(DevNum);
					if(Cal_after_Ack)nRF24L01_X_ce_high(DevNum);
					else nRF24L01_X_ce_high_pulse(DevNum);
				    USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				case CMD_RF_RESET:
					HS6200_Rst_Bank0_All_Register(DevNum);
					if(Dev_Flag[DevNum]==HS6200_DEV)HS6200_Rst_Bank1_All_Register(DevNum);
					USB_ACK_2_Host(DevNum,0,NULL,0);
				break;
				default:
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif	
					#endif  /*HS6200_DEBUG*/	
				break;
			}
		break;
		default:
			#ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SET_CMD);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SET_CMD);
					#endif	
			#endif  /*HS6200_DEBUG*/	
		break;
	}
	
}
/*
 *    P[0]       P[1]                P[2]             P[3]    P[4]     P[5..n]
 *    PID       DevNum       Packet context length    Type    Cmd      Argument
 *  PID_SET    DEV_0/DEV_1            xx               xx      xx         xx
 *   1Byte       1Byte              1Byte             1Byte   1Byte     nBytes
 */
void Set_Protocol_Resolut(void)
{
	U8 DevNum;
	U8 Cmd_Argument[0x28];  
	U8 Cmd_Argument_Length;
	U8 i;
	DevNum=USB_Host_Out_Packet[1];
	Cmd_Argument_Length=USB_Host_Out_Packet[2];
	
	if( (DevNum==RF_DEV_0) || (DevNum==RF_DEV_1) )
	{
			if( (Cmd_Argument_Length<= ( sizeof(Cmd_Argument)/sizeof(Cmd_Argument[0]) ) ) && (Cmd_Argument_Length>=0x01) )
			{
				for(i=0x00;i<Cmd_Argument_Length;i++)Cmd_Argument[i]=USB_Host_Out_Packet[3+i];
				Set_Mode(DevNum,Cmd_Argument,Cmd_Argument_Length);
			}
			else    //length err
			{
				#ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_SET_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SET_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/	
			}
	}
	else   //RF_DEV err
	{
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
    			LED_Out_Err_Info(ERR_USB_PACKET_SET_RF_DEV);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_SET_RF_DEV);
			#endif	
		#endif  /*HS6200_DEBUG*/	
	}
}


void Get_Mode(U8 DevNum,U8 *Cmd_Argument,U8 Cmd_Argument_Length)
{
	SDS_CONFIG_t Config;
	U8 i;
	U8 Temp[5];
	U8 Addr_Width;
	U8 pTemp[0x30];
	switch(Cmd_Argument[0])
	{
		case TYPE_REG:   //not finish
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif	
	        #endif  /*HS6200_DEBUG*/	
		break;
		case TYPE_PLD:   //not finish
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
				#endif	
	        #endif  /*HS6200_DEBUG*/	
		break;
		case TYPE_SDS :
			if(Cmd_Argument_Length==0x02)
			{
				switch(Cmd_Argument[1])
				{
					case SDS_CONFIG:
						HS6200_Bank0_Activate(DevNum);	
						Config.config=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_CONFIG); 
						Config.setup_retr=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_SETUP_RETR); 
						Config.rf_ch=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RF_CH); 
						Config.rf_setup=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RF_SETUP); 
						Config.feature=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_FEATURE); 
						
