kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
						Config.other0=0x00;
						if(ce_low_befor_write==1) Config.other0 |= BIT7;
						else Config.other0 &=~BIT7;
						if(Cal_after_Ack==1) Config.other0 |= BIT6;
						else Config.other0 &=~ BIT6;
						if(flush_tx_when_max_rt==0x01)Config.other0 |= BIT5;
						else Config.other0 &= ~BIT5;
						if(nRF24L01_X_is_ce_high(DevNum))Config.other0 |=BIT4;
						else Config.other0 &=~BIT4;	
						if(Tx_By_CE_High)Config.other0 |=BIT3;
						else Config.other0 &=~BIT3;						
						if(Nop_After_W_Tx_Payload) Config.other0 |=BIT2;
						else Config.other0 &=~BIT2;
							
//						Config.other1=0x00;
//						if(nRF24L01_1_EI==0) Config.other1 |= BIT7;
//						else Config.other1 &= ~BIT7;
//						if(nRF24L01_0_EI==0) Config.other1 |= BIT6;
//						else Config.other1 &= ~BIT6;

						Config.setup_aw=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_SETUP_AW); 
						switch( (Config.setup_aw) & (BIT0+BIT1) )
						{
							case nRF24L01_AW_5_BYTES:   
								Addr_Width=0x05;
							break;
							case nRF24L01_AW_4_BYTES:
								Addr_Width=0x04;
							break;
							case nRF24L01_AW_3_BYTES:
								Addr_Width=0x03;		
							break;
							default:
							break;
						}
						for(i=0x00;i<0x05;i++)Temp[i]=0x00;  //clear Temp,当读取的字节数不足5字节时，后面补0，回应主机，这主要影响到TxAddr,Pipe0,Pipe1。
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_TX_ADDR,Temp,Addr_Width); 					
						for(i=0x00;i<Addr_Width;i++)Config.tx_addr[i]=Temp[Addr_Width-0x01-i];
						Config.en_rxaddr=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_EN_RXADDR);
						Config.en_aa=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_EN_AA);
						Config.dynpd=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_DYNPD);

						for(i=0x00;i<0x05;i++)Temp[i]=0x00;  //clear Temp
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P0,Temp,Addr_Width); 					
						for(i=0x00;i<Addr_Width;i++)Config.rx_addr_p0[i]=Temp[Addr_Width-0x01-i];

						for(i=0x00;i<0x05;i++)Temp[i]=0x00;  //clear Temp
						if(Dev_Flag[DevNum]==nRF24L01_DEV)
						{
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Temp,Addr_Width); 					
							for(i=0x00;i<Addr_Width;i++)Config.rx_addr_p1[i]=Temp[Addr_Width-0x01-i];
						}
						else   //HS6200 dev
						{
							nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P1,Temp,1); 					
							Config.rx_addr_p1[0]=Temp[0];
						}
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P2,Temp,1);
						Config.rx_addr_p2=Temp[0];		
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P3,Temp,1); 	
						Config.rx_addr_p3=Temp[0];
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P4,Temp,1); 	
						Config.rx_addr_p4=Temp[0];
						nRF24L01_X_read_pipe_addr(DevNum,HS6200_BANK0_RX_ADDR_P5,Temp,1); 	
						Config.rx_addr_p5=Temp[0];
						Config.rx_pw_p0=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P0);
						Config.rx_pw_p1=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P1);
						Config.rx_pw_p2=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P2);
						Config.rx_pw_p3=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P3);
						Config.rx_pw_p4=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P4);
						Config.rx_pw_p5=nRF24L01_X_read_reg(DevNum,HS6200_BANK0_RX_PW_P5);
						
						pTemp[0]=SDS_CONFIG;
						for(i=0x00;i<sizeof(Config);i++)pTemp[1+i]=((U8 *)&Config)[i];

						USB_ACK_2_Host(DevNum,TYPE_SDS,pTemp, sizeof(Config)+1);
				break;
				case SDS_MCU:
					#ifdef HS6200_DEBUG
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_FUN_NOT_FINSH);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_FUN_NOT_FINSH);
						#endif	
					#endif  /*HS6200_DEBUG*/	
				break;
				case SDS_FIRMWARE:   //回应日期号
					 USB_ACK_2_Host(DevNum,TYPE_DBG, SoftWare_Date,0x06);
				break;
				default:
					#ifdef HS6200_DEBUG 
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_GET_CMD);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_GET_CMD);
						#endif	
					#endif  /*HS6200_DEBUG*/	
				break;
			}
		}
		else
		{
			#ifdef HS6200_DEBUG
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_GET_LENGTH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_GET_LENGTH);
				#endif	
			#endif  /*HS6200_DEBUG*/	
		}
		break;
		default:
			#ifdef HS6200_DEBUG 
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_GET_CMD);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_GET_CMD);
				#endif	
			#endif  /*HS6200_DEBUG*/	
		break;	
	}	
}

/*
 *    P[0]       P[1]                P[2]             P[3]    P[4]     P[5..n]
 *    PID       DevNum       Packet context length    Type    Cmd      Argument
 *  PID_GET    DEV_0/DEV_1            xx               xx      xx         xx
 *   1Byte       1Byte               1Byte            1Byte   1Byte     nBytes
 */

void Get_Protocol_Resolut(void)
{
	U8 DevNum;
	U8 Cmd_Argument[10];  //Cmd argument 长度暂定为10
	U8 Cmd_Argument_Length;
	U8 i;
	DevNum=USB_Host_Out_Packet[1];
	Cmd_Argument_Length=USB_Host_Out_Packet[2];
	
	if( (DevNum==RF_DEV_0) || (DevNum==RF_DEV_1) )
	{
			if( (Cmd_Argument_Length<=sizeof(Cmd_Argument) ) && (Cmd_Argument_Length>=0x01) )
			{
				for(i=0x00;i<Cmd_Argument_Length;i++)Cmd_Argument[i]=USB_Host_Out_Packet[3+i];
				Get_Mode(DevNum,Cmd_Argument,Cmd_Argument_Length);
			}
			else    //length err
			{
				#ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_GET_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_GET_LENGTH);
					#endif	
				#endif  /*HS6200_DEBUG*/	
			}
	}
	else   //RF_DEV err
	{
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
    			LED_Out_Err_Info(ERR_USB_PACKET_GET_RF_DEV);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_GET_RF_DEV);
			#endif	
		#endif  /*HS6200_DEBUG*/	
	}
}


void Debug_Mode(U8 DevNum,U8 *Cmd_Argument,U8 Cmd_Argument_Length)
{
	U8 Temp[10];
	U8 *p_xAddr;
	U8 *p_iAddr;
	U8 data_read[32];   //最大到32Byte
	U8 i;
	
