kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
	Cmd_Argument_Length=Cmd_Argument_Length;
	switch(Cmd_Argument[0])
	{
		case DEBUG_SOFTWARE_DATE:					   //0x01
//			USB_ACK_2_Host(DevNum,TYPE_DBG,SoftWare_Date,0x06);
		break;
		case DEBUG_SOFTWARE_VER:						   //0x02
//		    USB_ACK_2_Host(DevNum,TYPE_DBG,&SoftWare_Ver,0x01);
		break;
		case DEBUG_DEVICE_FLG:						   //0x03
			if(Cmd_Argument_Length==0x01)
			{
				if(Dev_Flag[DEV_0]==HS6200_DEV) 	//DEV_0 Info     
				{
					Temp[0]=0x62;
					Temp[1]=0x00;
				}
				else if(Dev_Flag[DEV_0]==nRF24L01_DEV)
				{
					Temp[0]=0x24;
					Temp[1]=0x01;	
				}
				else
				{
					Temp[0]=0x00;
					Temp[1]=0x00;
				}
				if(Dev_Flag[DEV_1]==HS6200_DEV)      //DEV_1 Info
				{
					Temp[2]=0x62;
					Temp[3]=0x00;
				}
				else if(Dev_Flag[DEV_1]==nRF24L01_DEV)
				{
					Temp[2]=0x24;
					Temp[3]=0x01;	
				}
				else
				{
					Temp[2]=0x00;
					Temp[3]=0x00;
				}
				USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,4);
			}
			else if(Cmd_Argument_Length==0x03)   //2 dev
			{
				if(Cmd_Argument[1]==0x00)Dev_Flag[DEV_0]=DEV_NONE;
				else if(Cmd_Argument[1]==0x01) Dev_Flag[DEV_0]=nRF24L01_DEV;
				else if(Cmd_Argument[1]==0x02) Dev_Flag[DEV_0]=HS6200_DEV;
				if(Cmd_Argument[2]==0x00)Dev_Flag[DEV_1]=DEV_NONE;
				else if(Cmd_Argument[2]==0x01) Dev_Flag[DEV_1]=nRF24L01_DEV;
				else if(Cmd_Argument[2]==0x02) Dev_Flag[DEV_1]=HS6200_DEV;
				USB_ACK_2_Host(DevNum,0,NULL,0);
			}
		break;	
		case DEBUG_MCU_INT:       //0x04  中断情况
//			Temp[0]=nRF24L01_0_EI;
//			Temp[1]=nRF24L01_1_EI;
//			Temp[2]=EA;
			USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,3);
		break;	
        case DEBUG_DEV_CE:	       //0x05
			Temp[0]=nRF24L01_X_is_ce_high(DEV_0);
			Temp[1]=nRF24L01_X_is_ce_high(DEV_1); 
		    USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,2);
		break;		
		case DEBUG_CAL_AFTER_ACK:	//0x06
			Temp[0]=Cal_after_Ack;
		    USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,1);
		break;
		case DEBUG_CE_LOW_BEFORE_WRITE:	  //0x07
			Temp[0]=ce_low_befor_write;
		    USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,1);			
		break;
		case DEBUG_DEV_BUSY:    //	0x08
			if(Cmd_Argument_Length==0x01)  //查看
			{
				Temp[0]=nRF24L01_X_Busy[DEV_0];
				Temp[1]=nRF24L01_X_Busy[DEV_1];
				USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,2);	
			}
			else if(Cmd_Argument_Length==0x03) //set busy bit
			{
				if(Cmd_Argument[1]) nRF24L01_X_Busy[DEV_0]=1;
				else nRF24L01_X_Busy[DEV_0]=0;
				if(Cmd_Argument[2]) nRF24L01_X_Busy[DEV_1]=1;
				else nRF24L01_X_Busy[DEV_1]=0;
		        USB_ACK_2_Host(DevNum,TYPE_DBG,NULL,0);	
			}
		break; 
		case DEBUG_CE_STATE_BEFORE_FLUSH:
			if(Cmd_Argument_Length==0x01)   //查看
			{
				Temp[0]=ce_state_before_flush;
				USB_ACK_2_Host(DevNum,TYPE_DBG,Temp,1);	
			}
			else if(Cmd_Argument_Length==0x02)   //设置ce_state_before_flush
			{
				if(Cmd_Argument[1])ce_state_before_flush=0x01;
				else ce_state_before_flush=0x00;
				USB_ACK_2_Host(DevNum,TYPE_DBG,NULL,0);	
			}	
		break;
        case DEBUG_TEST_MODE_OTHER_SPI_WRITE:     //特殊命令，留给FPGA调试使用。
            if(Cmd_Argument_Length==0x04)
            {
//                TEST_CSN=0;   //CSN pull down
                if(Dev_Flag[DEV_0]!=DEV_NONE)
                {
                    nRF24L01_X_spi_rw(DEV_0,Cmd_Argument[1]);
                    nRF24L01_X_spi_rw(DEV_0,Cmd_Argument[2]);
                    nRF24L01_X_spi_rw(DEV_0,Cmd_Argument[3]);
                }
                else  
                {
                    nRF24L01_X_spi_rw(DEV_1,Cmd_Argument[1]);
                    nRF24L01_X_spi_rw(DEV_1,Cmd_Argument[2]);
                    nRF24L01_X_spi_rw(DEV_1,Cmd_Argument[3]);
                }
//                TEST_CSN=1;   //CSN pull up
                USB_ACK_2_Host(DevNum,TYPE_DBG,NULL,0);
            }
            else
            {
                #ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_DBG_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_LENGTH);
					#endif	
                 #endif  /*HS6200_DEBUG*/	
            }         
        break;
        case DEBUG_READ_RX_PAYLOAD:  //查看刚才收到的payload
        	if(Cmd_Argument_Length==0x01)  //查看32字节 
        	{
        		USB_ACK_2_Host(DevNum,TYPE_PLD,&nRF24L01_X_Rx_Buf[DevNum][nRF24L01_X_PipeNum[DevNum]][0],33); 
        	}
            else if(Cmd_Argument_Length==0x02)   //查看指定长度 
            {
                if((Cmd_Argument[1]>0x00) && (Cmd_Argument[1]<=32))
	                USB_ACK_2_Host(DevNum,TYPE_PLD,&nRF24L01_X_Rx_Buf[DevNum][nRF24L01_X_PipeNum[DevNum]][0],Cmd_Argument[1]+0x01);
	            else //参数错误
	            {
	                #ifdef HS6200_DEBUG 
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_DBG_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_DATA);
						#endif	
	                 #endif  /*HS6200_DEBUG*/	
	            }  
	            
            }
            else   //length error
            {
    		    #ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_DBG_LENGTH);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_LENGTH);
					#endif	
             	#endif  /*HS6200_DEBUG*/		
            }            
        break; 
        case DEBUG_READ_ADDR:
        	if(Cmd_Argument_Length==3)    //访问内Idata区域
        	{
        		p_iAddr=(U8*)Cmd_Argument[1];  //初始化指针  
        		if((Cmd_Argument[2]>0x00) && (Cmd_Argument[2]<=32))  //读取的字节数在[1-32]字节
        		{
        			for(i=0;i<Cmd_Argument[2];i++)data_read[i]=*p_iAddr++;
        			USB_ACK_2_Host(DevNum,TYPE_PLD,data_read,Cmd_Argument[2]);        			
        		}
        		else  //参数错误
        		{
        	    	#ifdef HS6200_DEBUG 
						#if (DEBUG_OUT_ERR==LED_OUT_ERR)
							LED_Out_Err_Info(ERR_USB_PACKET_DBG_DATA);
						#else
							USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_DATA);
						#endif	
	                 #endif  /*HS6200_DEBUG*/
        		}
        	 		  
