kevinname/hfirmware/app/test/hal/TestMAC6200/C8051F_USB.c
        	}
        	else if(Cmd_Argument_Length==4) //访问Xdata区域
        	{
        		p_xAddr=(U8 *)((Cmd_Argument[1]<<8)+Cmd_Argument[2]);  //先高字节后低字节
        		if( (Cmd_Argument[3]>0x00) && (Cmd_Argument[3]<=32) )
        		{
        			//for(i=0x00;i<Cmd_Argument[3];i++)data_read[i]=*p_xAddr++;
        			//data_read=p_xAddr;
                    USB_ACK_2_Host(DevNum, TYPE_PLD,p_xAddr, Cmd_Argument[3]);
        		}
        		else  //参数错误
        		{
        			#ifdef HS6200_DEBUG
        				#if(DEBUG_OUT_ERR==LED_OUT_ERR)
        					LED_Out_Err_Info(ERR_USB_PACKET_DBG_DATA);
        				#else
        					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_DATA);
        				#endif
        			#endif
        		}
        	}
        	else
        	{
        		#ifdef HS6200_DEBUG
        			#if(DEBUG_OUT_ERR==LED_OUT_ERR)
        				LED_Out_Err_Info(ERR_USB_PACKET_DBG_LENGTH);
        			#else
        				USB_Out_Err_Info(DevNum, ERR_USB_PACKET_DBG_LENGTH);
        			#endif
        		#endif
        	}
        break;
        case DEBUG_CE_HIGH_LOW_START:
            USB_Host_Out_Flag=USB_HOST_OUT_FLAG_C8051F_USED;

            HS6200_Bank1_Activate(DevNum);           
            nRF24L01_X_read_reg_multibytes(DevNum, HS6200_BANK1_RF_IVGEN, Temp, 4);
            if(Cmd_Argument_Length==0x03)
            {
                Debug_ce_High_Low_Stop_Flag=0x00;
                if((Cmd_Argument[1]==0x00)&& Cmd_Argument[2]==0x00)Cmd_Argument[1]=0x01;
                while(Debug_ce_High_Low_Stop_Flag==0x00)
                {
                    nRF24L01_X_ce_high(DevNum);
                    Temp[3] &=~(BIT2+BIT3);
                    nRF24L01_X_write_reg_multibytes(DevNum, HS6200_BANK1_RF_IVGEN, Temp, 4); 
                    if(Cmd_Argument[2]==0x00)chThdSleepMicroseconds(Cmd_Argument[1]);   //delay Cmd_Argument*10us.                                            
                    else chThdSleepMilliseconds(Cmd_Argument[1]);
                    nRF24L01_X_ce_low(DevNum);
                    Temp[3] |=(BIT2+BIT3);
                    nRF24L01_X_write_reg_multibytes(DevNum, HS6200_BANK1_RF_IVGEN, Temp, 4);
                    if(Cmd_Argument[2]==0x00)chThdSleepMicroseconds(Cmd_Argument[1]);   //delay Cmd_Argument*10us.                                            
                    else chThdSleepMilliseconds(Cmd_Argument[1]);
                }
                HS6200_Bank0_Activate(DevNum);
            }
           
            else
        	{
        		#ifdef HS6200_DEBUG
        			#if(DEBUG_OUT_ERR==LED_OUT_ERR)
        				LED_Out_Err_Info(ERR_USB_PACKET_DBG_LENGTH);
        			#else
        				USB_Out_Err_Info(DevNum, ERR_USB_PACKET_DBG_LENGTH);
        			#endif
        		#endif
        	}   
 
        break;
		default:
			#ifdef HS6200_DEBUG 
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_DBG_CMD);
					#else
						USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_CMD);
					#endif	
			#endif  /*HS6200_DEBUG*/	
		break;
	}	
}

void Debug_Protocol_Resolut(void)
{
	U8 DevNum;
	U8 Cmd_Argument[10];  //Cmd argument 长度暂定为10
	U8 Cmd_Argument_Length;
	U8 i;
	DevNum=USB_Host_Out_Packet[1];
	Cmd_Argument_Length=USB_Host_Out_Packet[2];
	
	if( (DevNum==RF_DEV_0) || (DevNum==RF_DEV_1) )
	{
		if( (Cmd_Argument_Length<10) && (Cmd_Argument_Length>=0x01) )
		{
			for(i=0x00;i<Cmd_Argument_Length;i++)Cmd_Argument[i]=USB_Host_Out_Packet[3+i];
			Debug_Mode(DevNum,Cmd_Argument,Cmd_Argument_Length);
		}
		else    //length err
		{
			#ifdef HS6200_DEBUG 
				#if (DEBUG_OUT_ERR==LED_OUT_ERR)
					LED_Out_Err_Info(ERR_USB_PACKET_DBG_LENGTH);
				#else
					USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_LENGTH);
				#endif	
			#endif  /*HS6200_DEBUG*/	
		}
	}
	else   //RF_DEV err
	{
		#ifdef HS6200_DEBUG
			#if (DEBUG_OUT_ERR==LED_OUT_ERR)
    			LED_Out_Err_Info(ERR_USB_PACKET_DBG_RF_DEV);
			#else
				USB_Out_Err_Info(DevNum,ERR_USB_PACKET_DBG_RF_DEV);
			#endif	
		#endif  /*HS6200_DEBUG*/	
	}
}

/*----------------------------------------USB Potocol Resolut----------------------------------------------*/ 
/*
 * Analog test 根据需要进行更改BANK
 * 其他模式处于BANK0
 */
extern U8 g_interrupt_flag;
extern void HS6200_interrupt_process(void);
extern void MAC6200_interrupt_process(void);
void USB_Protocol_Resolut(void)
{
	if(USB_Host_Out_Flag==USB_HOST_OUT_FLAG_C8051F_RECEIVED)   //MCU Rx complete
	{

		switch(USB_Host_Out_Packet[0])
		{
			case PID_COMM: 		    //0x01
				Comm_Protocol_Resolut();	 	
			break; 
			case PID_SETUP:		     //0x02
				Setup_Protocol_Resolut();
			break;
			
			/*
			 *    P[0]       P[1]            P[2] 	           P[3]       P[4]
             *  PID_SPI	     Dev	 Packet Context Length	 cmd code	 argument
			 *	 0x03	 DEV_0/DEV_1         xx					xx			xx
			 *	1Byate		1Byte		  1Byte				   1Byte	  n Byte
			 */			    
			case PID_SPI:			  //0x03
				SPI_Protocol_Resolut();
			break;	
				
			/*
			 *   P[0]       P[1]              P[2]              P[3]         P[4]
			 * PID_SPEC	    Dev		  Packet Context Length   cmd code	   Argument
			 *  0x04	DEV_0/DEV_1			  xx				 xx			  xx
			 *  1Byte	   1Byte		     1Byte			   1Byte		  xx
			 *
			 */
			case PID_SPEC:				 //0x04
				Spec_Protocol_Resolut();
			break;
			
			case PID_DIGITAL_TEST:		//0x09
				Ditital_Test_Protocol_Resolut();
			break;

			/*
			 *       P[0]         P[1]            P[2]			    p[3]         p[4]
			 *	PID_ANALOG_TEST	  Dev     packet context length     mode       Argument 
			 *		0x09		0x00/0x01		   xx			   0x01-0x08      xx
			 *      1Byte		 1Byte			  1Byte				1Byte	    n Byte
			 */
			case PID_ANALOG_TEST:		//0x0A
				Analog_Test_Protocol_Resolut();
			break;
			case PID_SYSTEM_TEST:       //0x0B
				System_Protocol_Resolut();
			break;
			case PID_SET:               //0x0C
				Set_Protocol_Resolut();
			break;
			case PID_GET:               //0x0D
				Get_Protocol_Resolut();
			break;
			case PID_DEBUG:             //0x0E
				Debug_Protocol_Resolut();	
			break;			
			default: 
				#ifdef HS6200_DEBUG
					#if (DEBUG_OUT_ERR==LED_OUT_ERR)
						LED_Out_Err_Info(ERR_USB_PACKET_PID);
					#else
						USB_Out_Err_Info(0x00,ERR_USB_PACKET_PID);
					#endif
				#endif
			break;
		}
		USB_Host_Out_Flag=USB_HOST_OUT_FLAG_C8051F_USED;

	}
	else if(USB_HOST_OUT_FLAG_C8051F_DISCARD==USB_Host_Out_Flag)
	{
		USB_NAK_2_Host(USB_Discard_Dev_Num);   //  
		USB_Host_Out_Flag=USB_HOST_OUT_FLAG_C8051F_USED;
	} 
    
    if(g_interrupt_flag == INTERRUPT_HS6200)
        HS6200_interrupt_process();
    
    if(g_interrupt_flag == INTERRUPT_MAC6200)
        MAC6200_interrupt_process();
}

 

/*----------------------------------End Of File---------------------------------*/

